{
    "https://www.youtube.com/watch?v=2crhrbqCLzU": "In this video, I'm going to share with you three powerful productivity principles that allow you to get so much work done compared to everyone else that it makes you dangerous. These are principles that I use to finish medical school and work as a doctor while running a business full-time and the same principles that I coach to my thousands of students and professionals. The three principles are number one the performance paradox, number two the obvious target trap, and number three the marginal gains fallacy. And mastering these three principles makes you dangerously productive. We're talking about those people that you meet and you just feel like you cannot compete with them. Every time you see them, they are effortlessly making progress in their life. They are not doing two steps forward, one step back like the rest of us. Somehow, every step is taking them forward. And they're also not stressed and frazzled. They are calm and focused and somehow just getting everything done like a machine. And actually, the reason that they're able to be like that is because of the first principle, which is the performance paradox. Here's what I've learned. If you want to be productive, you need to have a product. Productivity is basically how efficiently the stuff you do leads to your intended product. Now, this product, it could be passing an exam, it could be getting a a job, getting a promotion, or it could be bigger than that. Maybe it's a series of exams, or maybe it's your not just a job, it's your entire career path. Or maybe it's bigger than that. Maybe the desired goal, your product is just to live an intentional life, doing the things you want to do, being the person you want to be, feeling fulfilled and free. But whatever it is, the way we measure productivity has to be based on the things that allow us to achieve that goal and create that product. And the difference between someone who is highly productive, dangerously productive, versus someone who is just busy is that the busy person is spending their time doing a lot of stuff. But the productive person is spending their time doing stuff that's meaningful to them. So if you look at a really busy person, they might be like this is the person. They're just like vibrating. They they're constantly just doing something. there's a lot of energy going in all sorts of different directions. Whereas someone that's really productive, they may not need to do so much, but everything they do is purposeful. And so with much less effort, they're actually able to make more consistent progress towards their goals. I remember when I was younger in my late teens and early 20s where I was really on top of that productivity train and I was trying to optimize absolutely everything and make myself more productive and I I lost sight of why I wanted to be productive. I just got sucked into this trap of being busy that I started feeling that as long as I'm doing stuff and I'm being busy with things that on the surface seem productive therefore I must be productive. But a lot of the times the things that on the surface seem productive are not actually the best things that you can be spending that time doing. A great example of that is just getting enough sleep or taking a break or just planning things. These are things that I typically was a bit impatient with. I didn't feel that it was very important. It didn't feel like I was busy and moving and making progress. And so I deprioritized that. I thought it's more productive for me to be spending my time taking action and doing stuff. But that's a very narrow and I would even say naive way of thinking about achieving a goal or achieving a product because human beings are not machines. And so when it comes to something like rest, rest is an integral part of not only what keeps you in the game long enough to achieve the goal, but also helps you to do that more efficiently and more optimally, which means the more fuel and effort you put in, the better the result you get out of it is. If you are a professional race car driver, you care a lot about maintaining your car. And you can imagine some gung-ho young racer that's coming in and planning on driving their car until it catches fire. That's a very shortsighted way of thinking about achieving a goal. And here's the thing, because you I had that mentality when I was trying to enter into medical school. My primary goal at that time was entering into medical school. and I was driving that car until it was on fire. But after you achieve that goal, there's another goal. And that goal is probably harder. And now you're on fire. You're burnt out. And so an interesting perspective is to extend your goals out. See the bigger product. So let's say that this circle is where you are right now and the star is where you want to get to eventually. If you've got a short-term goal, let's say that this is, you know, one year, 6 months. Honestly, there's actually a lot of ways that you can achieve that short-term goal. You don't have to be perfectly optimized. You can be doing all sorts of things and you'll still eventually get there. But as you extend that goal out further and further, longer duration of time, increasing level of challenge, there are fewer paths that get you to that goal. And so even if there is a way that you can achieve a short-term goal, does that put you in a position where it's actually harder for you now to achieve the long-term goal? Because remember, there are a lot of ways to achieve the short-term goal. And constantly thinking about productivity in terms of short-term bursts and only short-term goals will start developing habits and systems and processes that don't go the distance. that will damage your sustainability, increase your risk of burnout, and eventually be extremely counterproductive. And something that's become clearer and clearer to me the busier I've gotten, and this is the reason why I call it the performance paradox, is that in order to get more product, you often need to do less. The major difficulty, especially over time, is not whether you can keep yourself busy. It's not about whether you can execute on things. It's about whether you're executing on the things that really make a difference. And if you're not executing on the things that make a difference, sometimes it's better just to not execute at all. Save that energy, rest, recover, spend time with your family and your friends. Just like have an enjoyable experience of life. If you're in a race to get to the finish line, you have to recognize that you are not just a driver in the vehicle. You are the vehicle. You are the driver. You are the fuel. You are everything that is going to take you to that goal, which means you have to take care of yourself. It's a lesson I've learned the hard way that the more you care about the goal, the more of a responsibility you have to take care of yourself. And there are very few ways that you can take care of yourself. And do yourself a favor that is better than joining my free newsletter. I mean, imagine that. I have over a decade of experience coaching thousands of people. I've seen so many mistakes that other people make and I know how to solve those. Imagine if you could just get into my mind and then take those core principles like I'm giving you in this YouTube video, but it's just sent to your inbox every single week for free, perfectly distilled, written with my fingers. Is that a dream? No. It's my newsletter. But seriously, I do go through things that I think are pretty insightful that will help a lot of you who are struggling with productivity and learning. So if you want to sign up to that, I'll leave a link to the newsletter in the description below. So that was the performance paradox. And the takeaway from that is sometimes less is more. And that is exactly the theme of the second principle here, which is the obvious target trap. When I was going through uni and I had all my lecture schedules and then I had my work and business related activities and I had all of these different tasks thrown around like on a notebook and then on my phone and I was looking for a way to consolidate all of that into like a a single app that would allow me to sort of get my head around all my productivity issues. But there was no single app that I found that did that very well. And so I had sort of three or four different apps that I'd connect together and I created my own little ecosystem. And I honestly took a lot of pride in that ecosystem of apps that I developed because that system worked so well for me in managing all my different tasks in my schedules. It felt efficient. Ironically, what I realize now is that at that time I had fallen into the obvious target trap. The obvious target trap is when you think that there is a problem, usually a very obvious problem, and then you see an obvious way to fix that problem. And so you dedicate time and invest resources and effort into fixing that problem. But this can actually be an incredible waste of time, potentially the biggest, most problematic type of wasted time. Here's what happened with my apps. One of the apps got updated. It no longer connected with the other app I had it with. And then that made me not use those apps for like a few weeks. And a few weeks later, I kind of forgotten how it all comes together because it was so complicated that then I just stopped using it. And then because I'd stopped using it, but my entire life was on there. I had like hundreds of backlog tasks and schedules that were thrown around there that I had to manually then reexport out, funnily enough, back to just Google Calendar. And now this is not a Google Calendar sponsor segment. Not that Google Calendar needs a sponsor, but the idea here is that simplicity is really king. If you ask me now what my productivity system is, there's three things. A calendar app, the notes app on my phone, and a lit like sticky notes, literally sticky notes that I just write stuff on and, you know, with my hands and I just look at it with my eyes. Very, you know, ancient technology. And the reason is that I don't need anything more than that. It's very easy in the productivity space to overoptimize on obvious targets, things that you see a small problem with and you can obviously make that better like a new app or a fancy notion template. But the thing is, I really doubt that you or me with the fanciest notion templates and the newest apps is unlocking this level of productivity that has just never been reached by any person in humankind before us. There have been really impressive people doing really impressive, productive things for hundreds of years. And so the core issue with this obvious target trap is that it all just comes down to a lack of proper prioritization. When you learn to prioritize really well, 90% of your productivity problems will be solved. It's not going to come from time blocking. It's not going to come from a new app. It's not going to come from the way you do your schedule. It's not going to come from a Pomodoro timer. It's going to come from just not wasting your time on things you shouldn't be doing in the first place. And this concept of prioritizing effectively ties in directly with the predto principle. So if you're aware of the predto principle, the idea is sometimes it's called the 8020 rule. The idea with the predto principle or the 8020 rule is that 20% of the stuff you do is going to make 80% of the impact. Well, the other way to think about this is that if you've got a list of, let's say, 10 things that you're trying to do, then without prioritizing, you have got an 80% chance of wasting your time on the stuff that does not move the needle. So, your job is not to look at this list of stuff and just smash them out as quickly as possible. Your job is to look at this list and ask yourself, what are the key levers? What are the things that if I were to work on get me closer to the product, my overall goal as effectively as possible? Ask yourself that question and figure out what the 20% of the tasks that are worth doing actually are and actively reject the rest. These things that are not the key levers, they are not worth your cognitive bandwidth. they are not worth your mental attention and your time to optimize because the opportunity cost. What you could be doing instead is working on this stuff and these are the things that are going to push you forward towards your goal. And when you see that dangerously productive person, chilling out, looking relaxed, coming to the parties, and socializing, and you're wondering, how do you get so much done when you never seem to be busy? It's because they're spending the 20% of their time doing the stuff that really matters. It's not that they've got less stuff to do. They are choosing to do less stuff, which performance paradox gets them more result. Same principle with your productivity system or the apps that you use. I decided that the only apps I need is something to track my schedule, a calendar, and something to track my thoughts, a paper or the notes app. And I built a solid mental framework around how I use those two things. I doubled down on the key levers and I focused on creating simplicity. Now, I teach prioritization a lot and prioritization frameworks. And what I've personally seen is that the average person is not very skilled at prioritizing. Part of it is that some people don't have the frameworks, but actually the bigger part is that even when people have the frameworks, I found that they're usually not using them in the way that they need to be. And so I want to give you a quick tutorial on how to do prioritization really effectively. I'll give you a super quick practical framework that you can use and then the common pitfalls that I've noticed stop people from using those frameworks. And if you've ever struggled with prioritization yourself and you've tried it in your own life, then you'll probably resonate with these pitfalls. So the first thing that I want to give you is the framework. The simplest one I think is the or not and framework. You've got a lot of stuff to do. Someone asks you, hey, you want to get a coffee, get some pizza? You have to think, cool, I could do that and then I can fit time, do my other tasks afterwards, and then I can go for my jog after this. No, no, no. The way you think about it is I can do that or I can do this other thing in my priority list. Everything that you decide to commit to has an opportunity cost. Sometimes the opportunity cost is purely your own freedom, peace of mind, relaxation, and that could be extremely important. That could be the key lever for you that day. And so the or not and framework simply says when you're confronted with a new possible task or commitment to do instead of accepting it ask yourself what will you sacrifice in order to fit that in. Figure out what you're willing to lose. And by doing this one of two things is going to happen. Either you are correct. You genuinely did not have time to do both of those things. It's a good idea for you to have thought or not and and picked your loss very intentionally or you finish things faster than you expected and you do get time to do more than that and then you can just do it. You can just add that on and still get it done. There's genuinely no downside to thinking about it as or not and and connecting yourself with what you are intending to lose. But when you don't do this, that's when you end up with this overwhelming amount of stuff that you're constantly juggling and you never feel like you have time to do everything because you don't have time to do everything. The issue is that you're not connecting to the fact that you don't have time and you have to pick something to get rid of. Which brings me to the first major pitfall, which is that correct prioritization should feel bad. If you are even remotely newish to prioritizing and it doesn't feel bad, you are probably okay, there's only three situations here. Number one, it feels bad because there are important things that you want to do that you're actively saying no to. Feels bad or it feels good because you don't have many things going on in your life. So, you can basically say yes to anything and it's all easy. That's not the case for most people, especially most people watching a video about how to be more productive. Or number three, it doesn't feel bad because you're stuck at prioritizing and you're not connecting with the pain of what you're losing. In which case, it's going to feel bad for you eventually when you're not able to keep on top of all of your commitments and you realize you're falling behind. So either way, not prioritizing feels bad. Prioritizing feels bad. The difference is that when you prioritize, even though it feels bad, you are in control of your priorities and your life. You are deciding where to put your time and your attention and your mental energy. And over time, what will happen is that even though it initially feels bad, you will realize that hey, even though it feels bad because you're saying no to something, you are at the same time saying yes to something else that was actually more important for you. And when you feel the the benefit of having said yes to that, that's going to make you feel good. And eventually, this feedback loop is going to over time make it so that when you say no to something, you don't feel bad about it anymore because you connect that with what you're truly saying yes to. and that deep sense of fulfillment and satisfaction that you are really deliberately and intentionally taking control of your life that is a feeling that goes beyond just feeling good or feeling bad. So that's the that's the first common pitfall is that people don't feel bad enough or they avoid feeling bad. The second thing is that when you're prioritizing correctly, your task priorities should not be the same as your values. If every time you come to prioritize your tasks, you're doing it based on the priority of your values, that means that every single day there are certain tasks that are always going to be prioritized higher and then certain tasks that are always going to be prioritized lower. So that is actually going to create an imbalance of your priorities. That makes it very binary. It means that the one or two most important things in your values receive all of the attention and everything else is constantly put off and that is going to create a lot of value dissonance in you because you are constantly saying no to things that are genuinely important to you. And so the way that priorities and values balance out is that on a daily basis, your priorities should reflect the context and situation and what is important for you in that short-term period like for those few days. Balance out your values across weeks. So let's say you really value spending time with a certain friend. That's fine. Spend time with that friend, but you don't have to spend time with that friend every single day. You say no to the friend on Monday. You say no to the friend on Tuesday, you make up for it on the Wednesday or the Thursday or the Friday or the next week. And saying no to one of your values on any given day is not likely to lead to a meaningful consequence in a short amount of time. Your values are more like a compass. Whereas your task priorities is more like the road you're going to take. And so I would recommend spending active time at least at the beginning maybe 15 to 30 minutes a day depending on how much stuff you have to prioritize to actively sit down go through all of your tasks and use this or not and framework to be very clear about where your key levers are what you're saying no to and just re-evaluate your values and your priorities. Ask yourself, have I fallen into the obvious target trap where I'm spending time on things that I think are obvious things for me to work on when actually when you take a step back, that's not the thing that's going to make the biggest difference. FYI, for me personally, I usually review my task priorities and rep prioritize every day. And if I'm really really busy and there's lots of stuff on my plate, I might rep prioritize it even twice a day. So that's on a daily or weekly basis. I also recommend that you do this prioritization and you take a step back. You think about whether you have fallen into the obvious target trap on a longer term scale as well. Maybe once every 3 to 6 months and this is because it's very easy to get tunnel vision relating to your priorities. So years ago I was involved in the medical entry space like helping people enter into medical school. And so these students are very motivated entering into medical school. They're going through medical school. they're studying. Even from the very first time I meet them and I ask them, \"Hey, why do you want to be a doctor?\" They give some generic answer, but they're not really sure. And I can tell they're kind of just convincing themselves. They go through medical school, this question still lingers in the back of their mind. They become a doctor, it's still lingering, and then 15 years later, they're messaging me saying, \"Hey, Justin, how did you manage to leave being a doctor because I hate my job now?\" And it's the exact same concerns that they had 10 plus years ago that they just never addressed. That's an example, maybe an extreme example, but honestly really common of an obvious target trap just dominating for like a whole era of your life. You know, I said that nothing wastes more time than just doing the wrong thing. Well, this is an example where someone has entered an entire career path, spent 10 plus years of their life on something and then realized that it was the wrong thing to be doing because 10 years ago they didn't ask themselves this question. Is this entire pathway the road that I'm on? Is that the right road that I want to be on? Or is that road just the obvious target that I latched on to years ago? And the only reason I'm still on this obvious target road is because to challenge that feels too insecure. There's too much of my identity tied up in it and it's too destabilizing. Well, it doesn't get any easier the longer you leave it. If you're driving on a road trip and you feel like you're getting lost, you don't keep driving until you just see where you end up before you check the map. So, that's the obvious target trap. And by the way, if this is a concept that resonated with you, I talk about a little bit more in one of my newses as well. So, just a reminder, the link to that is in the description. The third principle here is the marginal gains fallacy. Did you know if you get 1% better every single day for 365 days, one year, you would be 37 times better than you are today. That is the crux of the marginal gains concept. It was made famous, I think probably by James CLA in his book atomic habits. That's where a lot of people are exposed to this concept. And you know, the idea is that these 1% gains are compounding. So even though it you know you're not really making much progress in these early days over time it stacks up and stacks up until you are you know multiple times better than you are now. And there's a lot of power and a lot of truth to this concept most of the time for whatever goal you're trying to reach. This is not going to be done in like one single line, one single shot. As you progress and every step you take, you are constantly going to have to make micro optimizations to your processes and to your systems to keep you focused and on track and productive. And every time you make that micro adjustment, that's a 1% change. But this is the part about this marginal gains framework that I don't see a lot of other people talking about, which is interesting to me because this is actually the thing that I see more commonly, which is that you can make a 1% gain every single day to slowly get better. But you can also make a 1% change that makes you continually worse. And so every day you're just getting 1% worse. Or what's more common is that every single day you make a 1% change, but you're not really moving at all. You're just kind of changing back and forth, up and down, and fluctuating. And the difference between the person that is marginally gaining versus the person that is marginally getting worse or the person that's marginally static and fluctuating. The difference is data. It's metrics. It's the feedback you get from the optimization that you're making. When you make an optimization and you get feedback on whether that was a good or a bad optimization, that tells you how to adjust your optimization next time or whether that is even a worthwhile optimization to continue with. The marginal gains fallacy is making 1% changes every single day believing that just because you make a 1% change, it is going to result in cumulative gain. In reality, you only get the gain when you measure what matters. I'm going to take an obvious example from learning. Let's say that someone's spending a lot of time learning, like lots and lots of hours a day. So, their primary metric they're going to use is hours of studying per day. So, hours of studying per day. Very easy to track and get feedback on. So they're going to make an optimization to try to reduce the amount of hours of studying per day. So let's say that they were originally writing lots and lots of notes. And so to reduce the amount of time that they're spending, they're going to use an AI to summarize the notes for them. So they're able to now cut their hours of study down from let's say 10 hours a day to 5 hours a day. So based on this metric, this is a great success. And so further optimizations should continue to build this marginal gain. Except this would be probably a terrible idea because the reason that they're learning in the first place is not to fill the hours in their day. The reason that they're learning is to pass an exam or to have expertise, have knowledge in their memory. So their true outcomes that actually matter for them are knowledge retention in their memory and knowledge depth or expertise slash the ability to apply what they've learned. These are the things that actually matter that they should be testing on. So probably what would end up happening is that by using AI to summarize these notes and therefore bypassing some maybe more helpful cognitive processes of learning that they were doing when they were writing their notes, their actual retention and their depth may go down. So yes, they have saved time, but they could also save time by just not studying and that would have the exact same effect of reducing the metrics that actually matter. And so I think this is a good example because the easy thing to measure in this case hours a day is not always the metric that actually matters. Measuring your retention and measuring your depth and expertise this this is much harder. It takes a lot more conscious effort. These are not metrics that are like readily available for you. But by not having these metrics that actually matter, you run the risk of being this person or this person. If you pick a metric that is actually wrong, where tracking that metric is going to make you change things in a way that's worse, you're going to become like this bottom person marginally getting worse. Whereas, if you're tracking metrics that are essentially meaningless, then you're going to be making futile optimizations that actually don't get you any closer to your goal. And so if you want to make those 1% changes compound into real gains, a lot of the time you have to spend extra effort to find ways to measure the thing that actually matters because especially for big complex long-term goals, the metrics are not readily available and easy to get your hands on. So one of my students is a emergency doctor training to be a medicine specialist and a lot of the learning that she's doing and little optimizations is to try to make her better as an emergency medicine specialist but it's very hard for her to track whether her knowledge is developing in line with an expert. We tried using chatbt getting it to give feedback on her level of knowledge but we found that compared to a true expert it just wasn't nuanced enough. That's a common current limitation with a lot of LLM engines. And so the extra effort she had to go to was to reach out to her seniors to create a mentorship network so that she could have meetings, go through problems and questions, talk about her understanding and get feedback to see and calibrate whether she was moving in the right direction or not. This is a very manual process. It takes time. It takes effort. Takes other people's time and effort. But it's necessary and incredibly valuable because it provides a rare data point about whether you're optimizing in the right direction or not. And the person who is dangerously productive, they've probably gone through this process already. They have insights about their own processes and systems. They've spent the time to ask themselves, hey, does this really matter? Does this really get me to my goal or not? they spent the extra time and effort to evaluate that and critically dissect what they are measuring to make sure that they are optimizing in a way that gets them to their goal. And so to help you with this, I'm going to give you two different ways that you can start measuring what matters. There are two different types of metrics that you should try to set up. The first is an outcome metric and the second is a performance or sometimes I like to call it a proxy metric. An outcome metric is when you get data on whether you're actually achieving your goal or not. So for example, if it's with learning, your goal is to achieve a certain level of retention and depth. So it would be about methods that give you data on your retention and your depth. So this could be something like just testing yourself, creating a test for yourself, using AI to generate a test for yourself. If the thing you're trying to optimize is your business revenue, that will be the actual amount of money that you generated. So you would track that by well just tracking your actual money. If it's a fitness goal like running that you're tracking, it's going to be your actual target running pace, right? So you're going to actually track the pace of your running. So the outcome metrics give you the answer. It tells you, have you achieved it or not? And if you haven't achieved it, what is the actual number, the level that you have achieved? So the outcome metric is the most accurate. It's the one that is most closely going to reflect your progress to the overall goal. And if you can readily generate outcome metrics for yourself, that's kind of the the best. You should do that as much as possible. But often outcome metrics are delayed or it's more subtle and ambiguous. It's hard to actually directly measure it. So let's say that you are trying to get a job and you need to pass a certain interview. It's really hard to create an outcome metric for whether you're passing or failing an interview because there are no real quantifiable metrics that you can measure that on and you can't just wait until you do the interview and then fail to realize that it wasn't good enough. So when the outcome metric is delayed or it's too hard to get visibility on it, then you would try to use a performance or a proxy metric instead. A performance metric or a proxy metric tells you how you are doing on the way to your outcome metric. It gives you a sort of checkpoint evaluation and these are usually things that are more easy to evaluate and track. So for example uh if you are doing that interview you might set up some kind of external you know mentor or senior that you can talk to to get feedback. If you're selling a product that hasn't launched yet then you might not be able to track the sales number which is what you care about as an outcome metric. So instead maybe you track the number of people that are registering to be interested in purchasing this or maybe you track your website views. And the good thing about a performance or proxy metric is that because they're just signals of progress, you can really measure anything. So let's say that the goal that you want to have is like more emotional stability. So that's very hard to measure as an outcome metric, but you can do a daily mood checkin. So you could have a daily mood. You could do emotional reflections and you can use this data to see whether you're heading in the right direction or not. So you might find that for your goal there are one or two outcome metrics that you can measure and then there are four or five proxy metrics where no single one of them is going to be enough to give you a picture. But by tracking all five of them, it gives you a pretty good idea about whether you're in the right direction. And the most important thing is that you are measuring the thing that actually matters instead of just measuring the thing that's easy to track when that may not really be correlated to the true outcome you're aiming for. And so that's the third principle, the marginal gains fallacy, or rather how to avoid the marginal gains fallacy. And so all of these three things come together in understanding that when it comes to productivity, sometimes less is more. And the way you decide what to spend your time doing is by avoiding this obvious target trap and doing really clear, sometimes emotionally difficult prioritization. And to make sure that the things that you are prioritizing are the things that get you to your goal, you need to set up these metrics to measure what matters. And so by following these three principles, not only will your productivity improve, but it will become easier and less stressful, and you'll be able to make more consistent strides towards your goal when other people may just be busy. That is what makes you dangerously productive. Now, if you're interested in more productivity tips like this, then you might be interested in watching this video here where I break down 22 of my top productivity strategies that you can fit in as part of your arsenal. So, if you're interested, check that out. But otherwise, thank you so much for watching and I'll see you in the next one.",
    "https://www.youtube.com/watch?v=O1e4zNfyowA": "and they go, \"Hey, my kid's 18. Uh, he wants to be a software engineer. What should he do?\" And I just tell them, \"Please listen to me so deeply, clearly. Get into What's up, man? How are you?\" >> Good. You? >> Good. Hey, uh, from a little bit of a different angle. Um, I've been deeply involved in software engineering, in particular, staffing. Sold my last company and, uh, do that at a really high level right now. >> Okay. for in general 300k plus specifically mechatronics, robotics lately. >> Cool. >> And uh I guess one thing I'd ask just seeing what you've seen my business partner and I after thriving off the co market, dude. I mean that was like hey do you have a pulse and a C minus knowledge of software engineering? Here's 180k. It was nuts. Like it was nuts. And we were printing. >> Yeah. But dude, that that side of the market seems to be dying quite brutally. I don't know if it's going to be an AI thing where companies are putting way too many eggs in that basket and this is going to pull back soon and they're going to say, \"Wait, we need real engineers.\" But it seems like, and I'm just curious your take on this. >> It seems like the place where from my perspective of being on the kind of outside of tech and helping so many people in and uh get these jobs, it's like, okay, so what roles are not being aed right now? What roles still need staffing where they're going to spend $50,000 for a placement fee? And I realize it's systems engineers, it's all C++, it's robotics, it's embedded software engineers, it's um of course a lot of data science, but like the good old, hey, I'm a JavaScript engineer and I do React and Node and I'm good with AWS. Give me 250K. That seems like that's violently dying. So that said though, we go all the way down to entrylevel kind of C++ engineers all the way through and I do just want to say and everybody listening, today's video sponsor is me. I built this site called getcracked.io because I noticed that there was a massive skill gap between what candidates know and what they should know. This isn't only skill up and interview prep content focused on language knowledge. It also includes things like operating systems, concurrency, design patterns, computer architecture with questions asked from top firms around the world. I also have a coding section here that teaches you realworld concepts. These aren't toy puzzles. These aren't contrived problems with principles like dynamic programming which you will rarely use ever in your career. These are real questions with real implementations and real explanations. Many of them having appeared in interviews in the past. Make sure to check it out. >> Stick to that C++. I have, you know, I have 90 LinkedIn recommendations. Um, all from architects and, you know, principal engineers and directors of engineering. Like I know recruiters, you can laugh at them. Most of them do suck. And, uh, you know, it it is a bunch of trash people in that industry. But coming from quote authority in the job market, guys, if you're going to pick CS from someone who sees this all day in and out, stick to that C++ side of things. I have I have these, you know, very successful PMP parents that I've placed and make money with, and they go, \"Hey, my kid's 18. Uh, he wants to be a software engineer. What should he do?\" And I just tell them, please listen to me so deeply clearly. get into the C++ side of things. When I tell you I've got these unbelievable companies that are like autonomous robotics at like the bleeding edge of tech that the only people they can find for these C++ engineers are like 35year-old dudes who are about to retire and they're desperate to find dude send me a good six-year person. I can't find with the 30 $40,000 in software we spend as a company a year, I can't even find good six, sevenyear C++ engineers. So, I really appreciate you not being gimmicky, not just saying, \"Learn to code, bro. Lol.\" And like the meaningfulness of how you talk to people and the reality of interviews. And I'm not technical, but I know what the [ __ ] array is cuz I've talked to these people and tech them out a bit. listen to what coding Jesus says. He will get you so much further than talking to AI or just grinding out leak codes because guys, yes, you need to be a technical fit, but they are looking at personality, too. And they will grill you down and if you don't come across right, you're not getting that role. So, uh I I guess I'm a little flustered because I feel like I'm talking to a celeb, but dude, I I really appreciate what you do for the platform and these younger devs trying to figure it out because it is a hard market right now. Yeah, thanks for that. How is it even possible for technical recruiters to go through thousands upon thousands, hundreds upon thousands of resume submissions that they get like 2 hours after a job positions open? Like there seems to be a massive gap in the market between >> candidates that are actually strong and then a recruiter's ability to properly screen a candidate and tell that they're actually good material. So, they can't um I make the joke that Susie Q in HR doesn't know what the hell she's looking at when she's reviewing uh >> these Indeed profiles, right? >> And this is ultimately why you have to end up paying me $50,000 because I'll just say in the 150 placements this month, this year, >> uh none of them are applicants. I post all my jobs, none of them are applicants. LinkedIn, email, cold outreach, phone calls, a bit of my Discord server. Uh, I'm head I'm a head hunter like through and through and through and through and through. You're getting a cold email with a good opportunity and you're gonna like like and again the these are the good ones that figured out they're good at this and they're going to go make their own money not working for a company. So, the reality is, dude, is Suzie Q in HR who's getting yelled at to go through the applicants, uh, they're rejecting a bunch of good people by accident. And what they're re what's really going on, and this is a whole different level that no one knows about. A lot of H-1B candidates send these unbelievably beautifully, phenomenally polished resumes and when you call them, they just yes you to death that they have the experience and Suzie Q jams up the interview pipeline because she's actually not technical. So the real issue is there's either automation of people being lazy internally or somebody who's not even technical enough who's placing like office admins that's also on the ATS sending hiring managers. Do you know what I'm saying with this? >> Yeah. Yeah. She has >> so it like gets bogged up or [ __ ] up. Uh or there's just like a man I don't want to look at this. are being lazy and they go, \"Yeah, I went through all the applicants and they reject 200 people.\" Like internal HR and recruiters, they don't want they don't get paid to make a placement. Do you know what I mean? >> Yeah. >> So, they just stay busy and that's why people apply. Now, on the other hand, guys, if you see 300 applicants in the last day on LinkedIn, please click apply. So many shitty candidates, dude. I'll reject 99% of applicants and then the couple bangers get the job. So like don't ever be scared away by that. But dude, to your point, like they're not looking at it. >> But but how >> and they're not technical and they're not engineers. It's just like slop from the human side. >> Yeah, I know. It's like that's what I called it. I called it like slop or clog. It's like all this artificial clog of all these people saying they're AI machine learning engineers. They don't know what a how to define a list or what a tpple is. Like how is Susie from HR even possibly going to filter through that? And that also makes it harder for like legit candidates to break through because you have all these guys [ __ ] You have all these guys artificially lying about what they do and then like when you ask them in an actual interview, I can spend 15 minutes with them and I know that these people don't know Jack. >> Well, what's interesting is uh I don't only do um headhunting for individual fees. I um do RPOS, which is recruitment process outsourcing. So let's say a company, maybe a smaller company just raised, let's say, as an example in one of my clients, $30 million, and in that fundraising, they need to hire 15 engineers. Instead of getting rinsed and paying 30k placements each, we'll do something like, \"Hey, give us all your jobs, you know, over six months, we'll fill these 15 roles and you pay us 20 grand a month.\" And they save a bunch of money. We get exclusivity. We're not fighting other staffing firms on the role and we're guaranteed money no matter what. Um, when I So, I'll go into their ATS's and actually have to handle it and and look at all the applicants. And when I tell you, dude, we'll get 300 applicants and I'll just look at it over a week. Uh, and I know I know the telltale signs of a [ __ ] resume, but when I tell you that I'm rejecting because of it's and it's primarily H1B candidates that and they say it because we asked. When I tell you on 300 applications 290 of them are for a C++ embedded engineer 290 of them are like JavaScript developers with two years experience that we're in India 3 years ago and there's nothing wrong with that. I placed great H1Bs but when I say it gets so [ __ ] clogged up that I don't that you might as well just click reject and throw the baby out with the bath water. That's also what's going on cuz you post a job remote or on site and in one and a half hours you get 200 applicants from people who you literally need to pay $10,000 to hire because they are an H-1B and they need to get sponsored. So that's a massive thing behind the scenes where you're just getting totally [ __ ] up. And guys, I know this sounds crazy, but this is like when you're applying to a job, dude, you're marketing yourself. It's all sales. like >> you see a good role that you're actually a fit for, take the time to make that resume shine for that role. You have to do that in this market. But and I'm telling you, I'm telling you boys and girls, the best thing you can do if you really find a role that you go, I am a fit for this for sure, not just clicking easy apply and spray and pray, but if you see a role that's banging, do your research. Go into the company LinkedIn, find an HR person, a director of engineering, send a nice message. Hey, my name is Michael. I recently applied. I think I have a really great background. I love your company and I would love to connect for this job opportunity. Now, when I tell you I'm internally with some banger companies, I'm not going to say their names, but like godsends of places to work. When I tell you when I have these RPOS's where I'm internal with these companies and managing their ATS and I'm in their Slack and I talk to all their hiring managers, when I tell you the amount of HR directors who go, \"Hey, Mike, this person hit me up on LinkedIn and sent me a message directly to the decision maker on a first call and interviews Slack.\" Like me, the amount of times I've had them be like, \"Hey, this person reached out on LinkedIn.\" Uh, you know, take a look and set up a call. Um, they sent me a nice message. You guys got to take the extra step, especially if you're younger. No one gives a [ __ ] about LinkedIn, dude. The whole thing's a slot fest anyways. >> Yep. >> Find the hiring manager. Send a nice message. Attach your resume. And then guess what, dude? Save them $35,000 from a staffing fee if you're a good fit. Like, this is the extra step, the extra polish, guys. It is cutthroat, dude. The best devs I've ever worked with in my life are out of work right now. Not all of them, but a couple of them. And they're freaking the [ __ ] out. You got to be competitive. You got And again, if you're not a fit, you're never going to [ __ ] a technical interview. They sniff that [ __ ] out in two seconds. When Coding Jesus has a typical call where he asks 10 questions, he knows, and you can you can confirm this, brother. >> Yeah. you know the way they reply to the very first question if they're legit or not. You know right away, true or false. >> Yeah, that's true. And that's why I ask basic questions to A lot of people say on Tik Tok, Instagram, why are you asking basic questions? I ask basic questions because if I can establish a baseline of like what you know, how can I build up on that and ask you harder questions? >> What version of C++ do you use? Uh just like what's the one they have like active on le code most often or like yeah that's like I've been just compiling like stuff with um I don't have like I can't remember the exact like version number but like I had it set up from like the latest one back in like November of last year. What? When what was that? The latest one. >> Uh 17.12. >> Um that's a compiler version most well no I don't which compiler goes up to 17.12. When I say C++ version I'm talking about the standard like C++ 17 C++ 20. >> Dude I wrote a hello world when I was 10. I ask on some of these JavaScript kind of as a joke, but I'm like, \"Hey, you know, you go into this interview, you're gonna know what a for loop is, right?\" The right answer is for them to laugh at me and be like, \"Yeah, recruiter buddy, I know what the [ __ ] a for loop is.\" But sometimes I ask that, again, not a technical engineer. I ask that question and they'll like stutter and pause and I'll be like, I can't [ __ ] send this dude to a client and say, \"Hey, uh, this guy's potentially worth $30,000.\" So, like, you know, you guys got to brush up, get your chops up, listen to coding Jesus, read, study. Like, dude, and back to your point, man. Uh, if you if you have a stacked GitHub and really good projects and you send the right message and you do all this extra stuff, you need to break into your first job because it's brutal, dudes. It's brutal. And dude, you got to have your LinkedIn open to work. You got to have your LinkedIn pimped. You got to be on dice.com and have your resume there because any recruiter worth [ __ ] is paying 10 grand a year for a dice job board to run a search for a resume. Like there are ways to maximize this journey. But also like you know you can't can't [ __ ] these guys. So if if you weren't paying attention in school, you're not up to snuff and you're getting [ __ ] wrecked in interviews, uh you know, you got some work to do. It doesn't mean give up, but like I don't know. I I just have a lot of hope for the younger generation, guys. You're not completely chopped, but just uh you know, God helps those who help himself and and you got to put the work in and do all the extra steps and write that cover letter and do the [ __ ] you don't want to do. But I just figured I'd like to put a different perspective to obviously a bunch of people thinking about their careers watching this channel. >> Yeah. >> Um and hopefully this was valuable. >> It is. Do you have two more minutes? I have a question for you, >> bro. I'm chilling, dude. I just had I had a nice date and a couple beers. I'm just hanging out, man. >> Okay. Uh my question for you is do you think there's a lack of talent in the US market or or no? Like I I'm not I'm actually not sure. Like I speak to a bunch of pe I see all these job postings and I see all these people and when I was actually interviewing so I start another job October 20th I believe that's my start date. >> Congrats. >> Yeah. Thanks. And I I was able to secure two quant offers. One non-quant offer. My next job's actually my next job is actually nonquant which I'll probably make a video about. I wanted to diversify my experience. I wanted something a little more chill so I can focus on get cracked. But um >> chill, right? >> Yeah. Um but what I was seeing during my interviews is even when I was interviewing with these quant firms, they're like, \"Damn, bro, you're a breath of fresh air.\" Because they're asking me to implement stuff that are basic like implement a mutex, implement a reader, writer lock, maybe something a little more complex than that. And candidate after candidate's just like, \"I have no idea. I don't know.\" Blah blah blah. like is there is there a skill gap here? Are candidates or or is it something else? >> Uh I actually believe it's a lack of proper marketing and staffing efforts by the company when they just post on Indeed and they don't want to do any additional outreach and they don't want to do any sourcing and they want to pay the bare minimum for exposure like they you know some awesome jobs we see cuz we do like reverse engineer marketing >> where we scrape jobs with O applicants. I go out and find some cool candidates and then we and this is all with automationwithcllay.com. We basically like pitch great candidates and say, \"Hey, you have 30 applicants. R's been open for 3 weeks. Here's a banger who's in the local market and available. Uh, do you want to interview him? Let's let's have a call.\" Like, it's good marketing. I think a lot of it is that, dude. I think a lot of it is they don't have the infrastructure to find the right people cuz there isn't a lack of talent. But the other issue is it's not that there's a lack of talent. I think there's a lack of availability though. And I think there's a lack of meaningful salaries. And I think there's a lack of um you know enough interest to cuz most engineers want to make at a principal or staff level. They need to be making 30K to make a move. They're not going to make a move to make an extra 10 15k. >> Yeah. I also think it's, you know, obviously quants, I've worked at quant before and it was a 400k base salary and that's not including TC. >> Yeah. >> Um, and that was in 2022. Dude, it was like goddamn impossible to get people to even reply to me. And if they did, they'd be like, \"Bro, I'm at six.\" So, I think it's partly like a lack of staffing effort where Suzie Q is trying to find quants on indeed.com and they're sending these maybe decent looking H-1B fake resumes and they go and interview and they're just like, \"Fuck, dude. Another [ __ ] interview.\" Yeah. And then a real >> engineer like you come on and they do say this is a breath of fresh air. It's their company's staffing and HR infrastructure's fault. Do you know what I mean? >> Yeah. >> It's really not a lack of And if there's a This is what I say. If you guys can't fill a job, either you're being too picky, you're not paying enough money, or your company [ __ ] sucks and they're looking at glass door reviews and they don't want to come work for you. That's it. You can fix any opening by paying more money for the most part. I think at this I I think I I I partially agree with that, partially disagree like >> like I could have taken a quant offer that pays more than the place that I'm going to be working at. But >> quants are a different beast though. Do you know what in general with software engineering as a whole though that's a whole different level of experience in my opin like as a professional a different kind of experience. Do you know what I mean? >> Yeah. The thing is though like whether somebody was going to say 3 400 or 350 or even 300 like my my living standards are not going to change. What's more important, >> there's no difference at that level. >> What's more important for me is I'm working on an impactful project with interesting people. I'm learning new tech and I'm growing professionally. Like that's at least that's what drives me. >> And that goes back to my last point of if your company sucks, aka you can offer meaningful work. Like it's one of those three things, right? >> Or a combination of all of them. >> And dude, once you get to a senior level, this is what people care about. They they don't care about making an extra 30k or 40k or 50k or even 100k. >> Yeah. they go, I'm bored in, you know, half the time when I'm actually have 10 out of 10 candidates reply to my outreach, it's because they're unhappy at work, not because their money hurts. Yeah. >> And like that's important, you know, that is why people leave and they won't take a counter offer because they're done. They're like over it and they're ready to leave. >> So, you're totally right, dude. Meaningful work. I would say after like year 15, 12, 13, 14, 15 where you know you're good and you know you can get a job, that's when people start going, well, I'll even take a little bit less money if I love what I'm doing. >> Yeah, my job now makes more than my job that I'm going to actually makes less money than my previous one. >> But then I told myself like, well, 30k less, 40k less. Like, it's it's not changing my living standards. Like, just get crack.io at currently is bringing me in 150k a year. And I'm sorry, man. I just started popping back into your channel and subbed. Is that your platform that basically your YouTube wraps around? >> Yeah, exactly. >> I mean, that's the real baby, right? >> Yeah, exactly. And like I I think I can grow that to a million a year. So like >> I mean, [ __ ] dude. If you could make an extra 150k working 20 hours a week and just billing 40 and put all your eggs into that and no one bothers you and micromanages you, that would be really attractive in this situation, right? That's that's the strategy cuz I think I think I can grow this to like I'm over a million a year. So like why would I need a sweaty quant job that like wants me to do on call at 2 a.m. when I can just get a a cushy tech job. Um >> I agree, dude. >> You know, >> it's way better to build a product and build a baby and have it last forever and realistically probably sell it, exit, and uh you know, if you wanted to go that route though and like go live on an island when you're done with this. >> I already have Man, I already have >> It's juicy. I already bought an apartment in Thailand. Like the plan is already in motion. It's in No, not now, but it's in construction. It's going to be built 2027. It's something like >> then at that point, bro, you can take a 100k and still live like >> Yeah. No. Exactly. >> Exactly. Um, what I also wanted to mention is I I it seems like a lot of So, I have interviewed at firms where I'm like, this is a great interview process. Three rounds, they're moving quickly. Maybe each round is like two hours, three hours at most. And then I've been at firms that want like over five hours a year time at once. and all they're doing is just blasting you with useless lead codes you can like memorize. Like as a senior dev, I'm not going to be interested in your company if the only things you're asking me in an interview is just brainless lead codes, right? Like >> most devs ask that first. What's the interview process? And I always make the joke cuz we've had to coach our clients into fixing this when they go, why can't we close and retain talent? Well, guys, it takes you four and a half weeks to uh review a resume to potentially get to an offer, and by the fifth round, you're asking them to do hula hula hoop trips for the CEO to get [ __ ] 30k in equity when this [ __ ] hole finally IPOs. Like, yeah, no one's no one's doing the dance with you guys. >> Yeah. >> So, that is an issue. They don't need to do that. I do think it's either like an ego thing or like there's just something there of or they haven't been coached properly or it's like the engineers director of engineering is the one who's making the interview process and like they don't really understand how the talent market works. That is a fatal flaw in a lot of companies hiring process though, you know, really the the good clients like I have have a wonderful client that is a technical interview with two principles >> sometimes and they're they're offered if they want to do this before they go on site, which means they got teched out in an hour and a half, had a really great interview, and now they're going to fly them out and have them meet the CTO and and the interfacing VPs and all this stuff. Uh, and then that's like 3 hours of there's no coding on site. Hey, do you like the team? Check out our physical product. Look at the, you know, look at the autonomous vehicles roaming around. Let us wow you with the experience of our office. Um, that's the right, you know, if you're going to do a three-hour interview and you're going to get an offer after and that's the only one over two two hours that you've done on step three, that's fantastic. But dude, companies shoot themselves in the foot because if you want to hire somebody, even with this AI and the market [ __ ] and this that and the other thing, I think uh staff engineers, principal engineers are impervious to this [ __ ] right now. And actually, I made a LinkedIn post showing what the hiring trends in the last year for engineers have been. It's basically entry-level people are absolutely not getting hired. Mid-level people like up to six, seven years are staying flatline. And then at staff and principal level are still like on an upward trajectory of moving jobs and making more money and getting more offers. So so it's pretty clear that like you guys are impervious to you know getting getting replaced if you will. >> Yeah. >> Um >> it's it's also >> those are the ones you got to you got to move fast on or you're just going to lose them, dude. >> What I Yeah. And and what I noticed too is the the more time you spend with a candidate, like it it's just like the more likely they are to make a mistake and the more reason you're going to give yourself to not hire them. >> Start nitpicking. >> Yeah. Exactly. So, if if a candidate's put in front of 10 people and they each need to make an opinion about this person and the candidate spent a total of 10 hours interviewing at this company, like there's just going to be somebody that's going to by just virtue of statistics, it's going to be that's going to say, \"I don't like this person for whatever reason.\" Or, you know, I asked him this one question to to probe this area. Yeah. It's like over what did you what did you call it? Over what? >> Overexposure. >> Yeah, it's overexposure. and you're like over you're trying to there's like no there's nobody out there that can continuously perform 100% in every interview after like 15 rounds they're going to screw up and that's just going to give you a reason to not hire them and to me that's kind of dumb >> that kis keep it simple stupid and dude just like maybe to wrap this I have a client that does professional services uh e-commerce implementations and they're in general like one to twoyear projects usually four to five devs at a time uh They heavily utilize the Latin American market. Uh, Brazilian developers are unfucking believable. Allow me to say. So, right now I have 40 contractors, all software engineers, um, contracting for that firm on projects. And what's amazing about that company is I've placed 40 engineers. The interview process is a 35inut. And you'll probably disagree with this, but these guys aren't fang, but just like hear me out how beautiful this is. Yeah, >> it's like a 35minut tech talk. There's no scripting. There's no do a for loop. There's no Java bunny ears [ __ ] It is a CTO who's this kid's a genius. >> Sure. >> But he's the right head who can dig down technically super fast. And dude, we're talking those 40 engineers are on about $12 million worth of gross profiting projects. So this is no joke. They can't [ __ ] their engineers up that they're putting on projects. I have only had to fire two people and it's primarily be been ultimately because of language barriers, but these are like principal full stack JavaScript engineers and AM developers and Java engineers. So the reality is, dude, you probably, if you have the right people interviewing, unless it's like a 600k [ __ ] software engineering role, you really don't need more than a couple hours of tech talk to make sure like decision makers like the dude. Like that's how simple it is to get talent. But they overco complicate it >> and they shoot themselves in the foot and then they can't find anyone. And then ultimately they pay a staffing firm $60,000 to send 30 candidates uh till they finally pull the trigger because they're fatigued >> and and when they pull the trigger they end up pulling it on a less qualified candidate >> and then they fire that person in 6 months which you know uh the cost of replacing some uh someone is up to 200% of their salary and it's just like dude it's just like the talent I know it sounds corny it's not engineering but the talent infrastructure of companies is lacking so severely which is why you guys don't get your calls back and some people say I apply to 550 jobs and it's easy to be like AI is cutting me and uh you know these are all ghost jobs you know that's cope a little bit but the reality is is these people are like exhausted there's too many people to go through and it's almost like they're forced to use AI or else the other option is Suzie Q in HR is not going to review 900 50 applicants in two weeks on four open jobs and then you guys just get stuck in the pile. Once again, go on to LinkedIn, find decision makers in a company. It's easy enough. You go to their page, you click members, you type something like director or HR, and you send a nice message, and you do that, and you you you uh supersede the ATS [ __ ] and it'll be so much more effective. But like, yeah, companies still run as like this monolithic like, >> well, tell me why you should work for me. You know what I mean? And it's like, no, no one's doing that anymore. You guys aren't giving them a Rolex after 30 years. No one has any loyalty. You need to impress them. You need to find the candidates yourself. And don't complain that they're, you know, back to what you said, like, why does it feel like I'm a breath of fresh air? Because their [ __ ] recruiting sucks, dude, because they're not working with me. So yeah, they're working with they're working on Indeed and a bunch of I'm sorry, brother. The best candidates I've ever placed in my entire life have not updated their resume in 10 years. Their last three jobs have been word of mouth referrals. >> Yeah, >> those are the people they're trying to find and they wonder why their Indeed applicants suck. >> So it is interesting, dude. It is an interesting problem, isn't it? >> Yeah. Thanks for calling in, man. I know I've taken up a bunch of your time. >> No, dude. I am enjoying this greatly, brother. I'll shoot you an email and uh we should hop on a call. >> Yeah, please do. I'm I'm definitely interested in talking to",
    "https://www.youtube.com/watch?v=gU2AhTTmLCU": "The era of the grad roll is dying. What used to be a safe, well- paid, well-defined path is now a relic of the past. Not only are these roles becoming increasingly hard to land, they're becoming more unpredictable in the long term with AI and firms gutting their training budget for juniors. I know this sounds counterintuitive, but for the right person, i.e. you here watching this video. It presents a golden opportunity, a back door to wealth, to impact, to ownership, and with a good salary, too. These roles are the fastest way to build wealth if you weren't born rich. And in this video, I'm going to show you how to land one in less than 7 days. Okay. So, for decades, the middle class has relied on a welltrodden safe path, which is you study hard, you get into a good college or uni, you graduate, and before you graduate, you've locked in a nice graduate job at a big corporate. From there, uh, in 2 years, you're an associate, three more years, you're a director level, end of the decade, you're at a middle management level, and if you're really demented, you might go for partner or seauite after that. This was the beautiful dream of predictable upward social mobility. Hell, I fell for it in 2008 when I worked at Mcquaryy Bank for 9 months, which was during the GFC and turned out to be a blood bath. You see, you might have heard from your friends or your parents even today that a job at a big four accounting firm or a big bank, a grad roll is the safest path. Well, let me tell you that that is absolute boomer wisdom. It's the belief that things possibly couldn't go backwards. And well, something has changed quite dramatically because grad rolls are down 33% in the UK last year, 24% in Australia in the same period. And so our playbook, that reliable playbook, uh, doesn't work anymore. And so we need something new. By the way, I cover lots of this stuff in my newsletter. Check it out. It's in the description. There's free tools and frameworks. And I'm not pushing any kind of course. You'll like it. All right, this is getting pretty doomer and you're probably wanting me to cut to the chase and get some hope back. It's coming. To truly tackle this problem, we need to understand what's happening first so we can reverse engineer a solution that gets to the root of the issue. And this issue is caused by two big macro factors. The first being that Western economies outside the USA have a big problem. They are service economies that don't actually build anything. Take Australia for example. In the last 30 years, we've created conditions for one of the world's most unsophisticated economies, ranking lower than even Uganda, Panama, even Kazakhstan. Look, Aussies are an unsophisticated bunch. But this is bad. We have no manufacturing industry and apart from a burgeoning startup scene in Sydney, most people work in jobs that do not create tools or technology that moves the world forward. Instead, most people work at big companies that exist to service other companies. Think lawyers accountants bankers advertising, sales. These used to be big, reliable businesses. And it's no surprise this is where the grad rolls used to be. And this is where the perfect storm comes in. That's all compounded by the second factor which is this concentration of corporate labor in service jobs has made these economies easy pickings for AI because senior people used to rely on juniors for a bunch of tasks including reviewing contracts and sending outreach and writing copy and these are a piece of cake for loss. Paper shuffling is what they do best. Now, beyond that fact, there's no doubt that these companies have used AI as an excuse to get more conservative, to reign in spending, to improve profit margins. That's just how big companies work. The old dream is not working anymore. And the scary part is is that no one's told young people this. Now, I spoke to a few grads in the making of this video, and one story out. A grad told me he applied for a role with 4,800 applicants and at the bottom of that funnel, only 21 got in. That's a lower acceptance rate than Harvard to be a category manager in a big supermarket in the northwest suburbs of Sydney. The first rung of the ladder is disappearing, and the diamond shaped or chart is becoming a thing. So, what do you do when this safe path becomes the risky one? Well, you take a different path. one that still has a good salary but gives you something new, something more modern, and that is ownership in the company, equity in the company, a chance to share in the upside. And this is what the smartest 22-year-olds I know are doing now. In the words of Paul Graeme, startups are simply small companies designed to grow fast. Uh they offer something new to the market, and the best ones offer something that's 10x better than the market. Now, a lot of startups are internet companies cuz they're based on that new technology which allowed them to offer something better, but that's not always the case. Startups exist in many different sectors around the world. And the good news is is that there's probably a startup for you, for your personality, your skill set, and for the impact you want to make in the world. Now, the best thing about small companies, if you've never worked at one, is and why they're way better than big companies, I've worked at both, is the chance to upskill. You basically get chucked into the deep end and you learn a broader range of skills. So you can try see what you like. You can be a generalist or you can specialize. It's really up to you. But these are chances you would not get in the corporate. And as I said before, this is the fastest way to build wealth if you weren't born rich. How do I know this? Well, I know a guy, and that guy was me, 24y old me, working in advertising, optimizing banner ads. Look, I knew that in the back of my mind that that wasn't going to make me rich. But it was only when I quit out of frustration, took a job at a startup, and got a piece of equity at Koala, um, that my eyes were open to the world. Yeah. And here's my share certificate. It's worth roughly $400,000 if you're judging by what the private markets are saying about Koala. Now, look, this isn't just my story. It is a repeatable playbook. I've seen it work. people at Camber, at Koala, at my company, Eucalyptus, and it's out there for you if you know where to look. Now, in my previous videos on sweat equity, most of the angry comments had been about, hey, this is super risky. Hey, like most of this equity is going to end up worth nothing. And that's true. Not every company can be a Koala or a Camber. And not everyone can work at Camber, Eucalyptus, and Koala like my two friends, Alexi Vitco and Matt Rossy. Oh, and there's always a comment about, \"Oh, this is survivorship bias.\" And the guy showing the classic meme pick of the bullet holes in the World War II plane. Great. And yes, there are risks to all good parts of life. But the thing is, you can layer these equity ownerships like a portfolio. You can build a stack of equity bets by working at different startups for 2-year periods and move on. So over a 10-year period, you might have collected five tranches of equity. And so after 10 years, you have this nest egg sitting there that could be worth a lot. Just ask anyone that worked at Canva. And in my eyes, that beats working for 10 years at com bankank slugging in the mortgage salt mines any day of the week. You see, grad jobs pay you to follow, but startup jobs pay you to build. Okay, let's look at how to get these roles because they're not on Indeed or Monster or Seek. [ __ ] no. They are harder to find. So, one, how to get them, and then two, how to position yourself best to get them. Now, it might seem like there's fewer of these roles because they're harder to find. They're not on some university portal or on C. No. Well, the thing is they're out there. They're just spread out and around. There are hundreds of startups in Australia alone hiring right now and junior roles. And so what you can do is go to aggregators. Um Anthony and David made a website equityjob.com.au after my uh first equity video. It's an awesome resource for companies that are hiring startups that are hiring in Australia right now. But still, my favorite way and the foolproof way to find these jobs is to go to venture capital firms websites. And you can do this in any country of the world as long as you know what the local VC firms are. And so in this example in Australia, this is Blackbird. You click on the portfolio and you can see here a list of all the companies that they've invested in. And you can even read about why they invested in some of these companies like this example here for Alloy. Uh, and then I can from there I can go to their website and I can see their career listings. So VC firms like to invest in good companies and so they do a whole bunch of due diligence on these companies making sure that they're good, they're high quality and so you can use this as a proxy to work out which companies are good starting points. Now it's not foolproof. There will still be some many failures and many [ __ ] companies on these lists, but hey, you can get going. And so you want to find a company that is the sweet spot for your risk appetite. So the earlier you join, the more chaotic it will be, but the more ownership in the company you will get. And the later you join, the more stable it will be, but the less ownership as a percentage of the company you will get in your shares or your options. And the good news here is that you start to specialize a little bit more. So if you don't want to be a generalist, uh the sort of 20 to 30 people mark is where things get a little bit better. And then at the 400 person mark, as startups get bigger and bigger, um they tend to get a little bit more corporate. They tend to attract people that are a little bit more riskaverse, a little bit more reliable. And so, not saying that's a good or a bad thing. Um if you were looking at grad roles, you might be that way inclined anyway. Um but yeah, just a heads up, that's what it's like. Uh worth keeping in mind. So, what kind of roles is this just for product managers and programmers? No, it's not actually. It's for a whole bunch of roles because as startups get bigger, as I was saying before, they start to specialize. They need office managers. They need customer support. Hell, I found a job for a janitor, uh, a cleaner at Gilmore Space in Australia. Amazing. And it comes with equity. So, you start in these roles like this one at Instant for Custom Support that do not require experience. You get your foot in your door just like a grad roll and you go from there. And you'll also see that many of the newest, hottest companies don't even have a careers section because they're so small. Or they'll do something like this, uh, which is Laura in Sydney, which has posted a job ad for pitch us a job, which is basically a filtering mechanism for really, really good people. So, if you're willing to do the extra effort and put together an awesome pitch uh of yourself, of a potential business idea, you might get a look at jobs that literally no one else can. You see, the challenge with startup roles is that the hiring process is not clean and positioning yourself for the role is critical because quite often you have to get the founders's attention, get the hiring manager's attention. This is not a, you know, well orchestrated perfect funnel on the website of a bank that tells you exactly when uh job ads are being processed. No, this is a bit of a free-for-all. Uh, but this is a feature of this because it's attracting people that have the go-get to go out and take these jobs, people like you. And so the trick is to spend 80% of your time on your cover letter, on your outreach approach, so your LinkedIn direct message, on your email to be yourself, be casual, add some value, give them an idea. That's where you spend your time because ultimately and take it from me as someone who has looked at thousands of rums, no one is reading your doc x times new roman CV or resume, focus on the first thing that people actually read because that sets you apart. So yeah, the most important thing is to shoot your shot, to be yourself, be direct, be clever, stand out, don't be corporate. People that work at startups are incentivized through equity to hire great people who in turn help them by growing the enterprise value of the business. Whereas in grad roles at corporates, you're actually being hired by people um it's a lot more zero sum. You're being hired by people that might in the short future be in direct competition with you for roles. Yes, this is a lot more chaotic than the perfectly managed hiring funnel of a grad roll, but it's going to be a lot more futurep proofed. And this hurdle is what makes these jobs so satisfying. So in a week you can go from spraying and praying graduate job applications to landing ownership at a company. Pretty cool. Don't play a broken game. Play a better one. Love you all.",
    "https://www.youtube.com/watch?v=8anNWhbFCmA": "As someone who's lucky to have seen it, it feels weird to write off an entire country based on six to seven streets, right? >> Yeah. >> I don't know why that's a radical perspective to have, >> but that's one of the reasons I amongst others that I uh reacted the way I did. >> You told your truth. >> It feels like a disservice to contrast a few streets with a massive country, 47 prefectures, rich culture, and 125 million people. H >> I cannot believe some people felt that wasn't that didn't make sense. We'll talk about it. >> We talk about lunch. >> I don't want to go on about it too much because >> Yeah, it's not about that today. >> This is like something I've been looking forward to. >> Yeah, >> I'm having immense fun today. >> Uh it weighed on my mind yesterday. >> It is weird doing the cycle >> while my phone is going all over the place. It's like living in two worlds sometimes. Your phone and real life or the internet and real life really. I remember when uh I uh when was it? I went on that stream with Connor. We talked about Mr. Beast Logan Paul a year ago. I was in uh beautiful uh place Takama Hat Takama and I was surrounded by the most incredible scenery on one hand. And then I looked at my phone and it was the worst thing that I had ever seen in my life. So much hate and negativity and conjecture and God. And I hated looking at my phone that day. And I'm trying not to make the same mistake today. Um, you know, >> social media is the abyss. That's a that's a good way of phrasing it. It can be social media can be a force for good, but it can be a terrible place, you know, in general. I mean, the internet's the same thing. And if I do one thing next year, it is spend more time outside in the world, meeting people, doing things, and not letting myself get consumed with the internet and the >> worst as the the sort of unpleasant aspects of it. >> No. Just remember, always check the things you see online. This looks very good. >> Give you the grand tour >> soup. pickles, broccoli, and salad. Nice. Zen zenai means appetizer, Japanese. And this looks very good. We uh we're very we're a bit unlucky earlier when we got to the restaurant and it was full. But this looks like it's going to make up for that meal rather well. Succulent meal for the for Mr. Aable. Thank you. Do you see yourself giving up the online life down the line to focus more on what you have now in real life? Not necessarily. I think this whole episode's reminding me the importance of speaking up on certain things. >> Yeah. Are you busy getting all the rice? >> I think you did a very eloquent job >> of eating rice. >> No, your video. >> Oh, no. Thank you, father. When father is impressed, it is all worthwhile. >> Yeah, >> but when father doesn't fit his plate on the table. That's disgusting. We're like one of those weird like couples that insist that we have to sit on the same side in the restaurant. >> Well, we've made the right decision cuz I'm on the left side and I'm left-handed right? >> Oh, wow. >> Otherwise, it's like bang bang bang. >> I like it when you bang bang bang me. T legs banging all the horrible. >> I think when you're a big creator, there is a burden of responsibility. Imagine if I had made a video, the original what's happening to Japan video myself, right, with an audience of three billion people. >> Some people, rational people would have called me out. I mean, been like Chris made a bit of graffiti and some bin bags is not Japan. But a lot of people would have been, \"Oh, Chris is a figure of several million followers. I respected some of his previous videos. He's right on this >> and I am in a position to shape opinions and it's very scary and dangerous.\" >> Yeah. >> And it's extremely important to portray objective reality as best you can online. I think you do you do um a good job at um >> I know I've got a reputation for exaggerating things and being silly and comedic, >> but I genuinely I check what I can. I try to portray things objectively. >> When when you can make a video, you make a very good video. I think that's your strength. And then also you're you know you're very strong in your opinions. >> I think it works well. >> I think my only regret >> is maybe I've held back on some of my opinions in the past genuinely. I know I'm you know >> uh about various things and >> but I I don't want to keep I don't want to I don't want to keep waddling into >> I mean this is a sort of personal related issue. >> Yeah. >> I felt >> you always as a creator you always run the risk of >> we can tackle anything but >> yeah you can sometimes sometimes you can uh pick too many fights and then you're the creator that's always picking fights. Yeah. >> It's important to know when to speak up and I think this is a right topic where >> you understood it well. Oh, you came from a good point. >> Well, not just that. I uh the street that was the sort of focal point of the video was somewhere I walk down every other day. You know, >> I It's a weird moment when you have to dox yourself >> essentially to prove a point. >> Yeah. >> Um but >> Chris went so >> He's gone woke chat. We've woke. >> Oh god. What was that about Jafar? >> I want to create a serious video. Jafar, I didn't understand. >> I'm sure someone will drench that up. >> Um, >> I think you did a great job. Cheers, man. Interestingly, when I uh when I told my friends I intended to make a video, they were all very worried >> cuz they thought it's going to be Chris's normal, sarcastic, silly, funny demeanor. >> But there was nothing about this that made me laugh. And >> when they every single one of my friends and close associates when I showed them the video, including yourself, >> Chris did so well in the cycling. >> Thank you. >> Thank you. uh when when I when I showed everyone the video, they very much went, \"Oh, yeah, this is actually an important video.\" I >> Well, >> because I present I don't think people didn't really appreciate the the the sort of >> Well, you didn't focus on drama. You focused on >> not just that though, >> or like hitting another case. >> People thought this was about one video. >> Yeah. >> And thought it was about one video when it was about eight videos and a much bigger issue. >> And I think the video hopefully explained things in a way >> that made it clear why I reacted the way I did. Um, and there are other things. At the end of the video, I talked about how I've lived here 13 years, and people write off my opinions because I'm not born in Japan. I'm not Japanese. >> And at what point do I become a local? What point does my opinion matter something? >> Yeah, >> I saw people react being like, I think it's important we got the locals opinions on this. >> I am inherently a local and I lived in Megaro for three years or so. Um, not that people knew that. Um, but uh when at what point do you become a local? What point does your opinion become valid? And I've had people attack me this year. >> They'd be like, \"Oh, Chris is wrong. He's just a foreign guy living in Japan.\" >> Uh, you know, we had some things happen earlier on this year. >> Yeah. >> Um, which I went dredge up. But people were ruling out my opinion because I I wasn't Japanese. And it was like, well, I've did this 13 years. I've talked to thousands of people. I've been lucky to travel to every corner of the country. If we are just discounting my opinions because I'm j I'm not Japanese. Then what's the point of everything I'm doing? You know, I >> mean, we both spent most of our adult life here. Uh I, you know, in many senses there's a lot of things about me that I feel is very much more aligned with Japanese culture than uh British. Obviously, I'm still very British, but um >> when you going to wear a kimono and be like, I am Japanese now. >> I'm thinking about it. actually my 30th birthday. That's You're invited, by the way. >> Very good. >> Um, it's tough, man. I mean, I think you did a good job because you didn't >> It's not about >> It's It's a problem. The problem is is that sometimes when you talk about this stuff, >> um, you can sometimes be self arandizing or whining or uh punching down. I think it's important to know how to explain why you're maybe getting, you know, explaining something or >> and I think you did a good job with it. So >> yeah, >> I'll I'll stop glazing you now. Back back to telling you you're a [ __ ] >> Thank you, man. Thank you. Um and thank you to everyone who you know and I you might have seen yesterday and other things that >> I've not been myself the last few days. I've been it's weirding the whole [ __ ] >> I was I was actually quite nauseous the last three days. I didn't sleep because I thought my video would get a lot of heat or people would think I'm >> unnecessarily, you know, being unreasonable, whatever. >> And I thought, have I got this wrong? Am I actually going mad here? Like, is my reality different from anyone else everyone else's? And seeing the response, the reaction from people has lifted a weight that has been on me for about four or five days now. a real taking a serious toll on my mental health that I've done a very good job to disguise. Um so thank you to everyone who supported me in the comments and the videos wherever online uh it it's meant the world to me and um I feel a bit more sane now and even though I didn't sleep last night very well, I feel a lot more energetic and happy today. I feel like a weight has genuinely been lifted. >> I went to bed at like 11:00 and Chris was like editing away. I didn't go to sleep till 1:30 and then I No, I I got to bed at 1:30 and then I didn't fall asleep till like 3:00 and then I woke up at 7:00 cuz Connor woke up, started cooking sausages. >> Oh yeah, God forbid Connor wakes up and cooks you food. >> It was a nice nice man. Good man. Um and I would say yeah, call out people that are wrong, including me, including him. If we say things that you don't think are right, always call the people out. Even especially if there are people in positions of influence. Um, well, if you have if you haven't seen the video, the video covers the topic a lot better than me sitting here dehydrated >> and eating some rice, >> uh, but eating some bottomless rice. >> I would urge you to watch that instead. >> It's a good video. >> Um, I think that pretty much covers all the bases on what I want to talk about there >> cuz I am drawing a line under this. I'm not there's not going to be a tip for tat. >> You don't you don't want it to be dragging on, right? >> It put me in a it I was so excited about this week. um both the Shiman Army and the days ahead. I was going to edit this video Natki and I going down the Nacasendo Trail. So much fun and I had to sort of postpone that project by two to three weeks because of this amongst other things and it just robbed me of any happiness this last week till I got this out of my system. But now I'm drawing a line under it. I'm sure people will react and dredge things up and there'll be lots of horrible coming my way, >> but that's the price I pay for and that's I I've accept that. But I'm gonna draw a line under it. I'm gonna ignore everything. Um, yeah. >> And I'm just gonna get back to to doing what I do best, which is trying to make content that's insightful and fun and educational. So, thank you guys. >> I think the reason why creators often don't do this is because it can just become a pissing contest. >> Yeah. I mean, I'm sure there'll be more. There'll be more. There'll be more stuff and it'll be endless. But I have to move on. That's what we say. You be >> what? We're serious. What the is this? The heck? No. Here we go. >> Um, no, you are right though. >> I mean, it's it's you know, I think that's why when you were like, I'm going to make a video. I think I was like I was like, \"Yeah, just make sure you don't make it.\" >> Yeah. And thank No. No. No. No. Absolutely not. And thank you. Um, you were the first person to see the video. Actually, Hana was very supportive. So, thank you, man. >> And thank you. when I post about it originally, you you you chimed in as well as I've noticed I've noticed at times when I talk about things of sometimes I don't have other people's backs, other creators, and it feels a bit like throwing myself under a bus without any support. And there's been a real ground swell of support this time hasn't gone unnoticed. >> I got your back, man. >> I even if you do something stupid, >> I do stupid things. >> Don't enable me. No. >> Okay. Well, you should ask. do you sort of keep tabs on? Who are the friends who are helping me when I'm at my lowest point? Who are the friends actually and you've been there so I I appreciate it, man. >> And that won't be forgotten. So, thank you. >> Feel like I'm >> That's the end of that. >> I've secured myself some promotion or something. >> Unsubscribe to CEO. >> Okay. >> Don't enable COVID. And look at now look at this. Trying to enable my stomach. >> One thing about the um YouTube and creating videos and stuff is that it does feel like right now There is a massive reward for just making videos that just lie or uh play on people's kind of political leanings. >> It's scary. I mean, >> even look at my video. It's got an insane number of views in a very short space of time. I'm sure a lot of people are clicking on it waiting to be angry about something and it's probably not what they expect. >> And it's sad cuz you you put so much effort into the the recent weekend. It obviously isn't going to do as well. It's not a sensation. >> I mean, it's a bit of an easy one racing around. I mean, >> it's a great video. >> The video that upset me the most this year was the volcano documentary we spent >> three or four months working a tough. >> It was a weird one. I mean, I get most people don't really care about volcanoes in everyday life. >> And I'm glad it's still got 700,000 views but >> it it it influences the choices we make. >> That's amazing. >> Is that sausage? It influences the content that I can make. Why, you know, I could go out and do spend four months on a volcano documentary. I could go what's happening to Japan and get three times the views in about 100th of the time in terms of production. I think the the the sad thing about all the platforms right now is that if you're if you're a person who does not care about what you're putting out there and there's bad intentions which isn't in I wouldn't say like a lot of creators do this but you know it's very easy to make money from just lying or showing things badly but also the saddest part is that I feel like you know there are some people who maybe aren't >> as strong willed or maybe they they they need a bit more money >> and they would probably go towards doing more sensational stuff because there's a guaranteed way to get money and Other people wouldn't have done that otherwise had the platform not incentivized it. >> Yes. >> And that's like a roaring part for me is that like >> it's great if you're a creator who's established like us and we kind of do whatever we want but if you know we we have some viewers who are shock it it it almost you know it's a learning lesson. It pushes these creators to go to more extremes. >> I have seen more and more creators doing things like filming homeless people in Japan because it's going to get the clicks going to I went to uh Japan's worst slump which is Nishinadi and Osaka if you're wondering. Um, I've seen various creators go uh creators from overseas go there and film content because they think, \"Okay, >> people want this. People want to, you know, see the dark side and they they'll just walk in with an action camera without >> I think it plays into the fact that there's like a as much as the people who really like Japan, idolize Japan, there's also the other thing that's shifted now where >> there are a lot of people who want Japan to be the >> cuz they're like because they hate hearing about how good Japan is. >> And so I think there's like a quite extreme on both sides and so I think and also a lot of this is also just playing into you know fearongering and just absolute nonsense. Well, I mean, the comments that I cited in the video, it's genuinely shocking. >> There was this assumption that a lot of the graffiti had been done by, you know, foreign people. >> I'm sure like there's probably >> you go online, I'm sure you can find a foreign person doing graffiti at some point. >> But I was in Nakame the other day and I was talking to a friend who owns a restaurant there and he was like, \"Oh, there's a um\" he told me, \"Oh, there's a graffiti exhibition on this week.\" and like one of the top biggest artists coming to Japan and uh hanging out with Japanese graffiti artists. And that could be one reason why there might have been a surge in graffiti potentially. I don't know. Or maybe in September and October there were a lot of national holidays in Japan and kids have a lot more time on their hands to go out do silly things. >> But there was none of that sort of speculation. I think",
    "https://www.youtube.com/watch?v=Xxr4l00hkwA": "Hi everyone, Anthony Fantano here, internet's busiest music nerd. And as you can see, uh my IRL guest today for this special interview is none other than Nina Gerra. Her newest project, I Love My Computer, is out now. Uh she has graciously brought this here for me. Uh but uh yes, one of my favorite electronic music albums of the year. We're going to talk about this record and anything else that comes up in this conversation. Uh, Nina, thank you for coming out and making the time. >> No, thank you so much for having me. This is really cool. I'm glad it worked out. >> How's the tour been going so far? >> It's been awesome. We This is um I mean, we're done now for America. We go home tomorrow for the year, but there's more America next year starting in January. So, it's kind of still going, but the first leg is done. And it was so awesome. I kept saying to my team who I'm traveling with like not long ago, any one of these shows might have been like the best show of my life, but they've all just been like so fantastic and the the fans and the people coming have been so kind and yeah, it's it's been crazy. >> So, you're like adjusting to the fame. You're adjusting to the uh to the limelight a little bit. Is that what you're saying? No, I mean like I just I just mean like um you know I'm not used to the energy being like I'm not used to having people like know all the songs and sing all the songs and like have the energy be so high like consistently through the set. Like it's just really new and it's kind of the way I've always wanted my shows to be. But yeah, >> how do you feel like maybe going forward that could impact I don't know just the the the way that you view your creative process in general and the way that you just like present yourself? Because it sort of seems like a lot of your earlier stuff and even the way you're kind of putting yourself out there on the cover of the new album, like everything that you do is like coming from this really like intimate personal space. I'm in my room. I'm surrounded by all my stuff. I'm just like vibing with my clutter, you know? [Music] kind of waves out there in a way to no longer feel like it's just online and it's just sort of like a digital. You're now being like confronted in a big way with like, you know, just the reality and and and the impact of of what you're doing. Has that shift been a wakeup call or been kind of shocking? Yeah, it's definitely been um surprising especially because like you said a lot of the music is about myself and I was only really thinking about myself when I made it. So, you know, like when you're super like a lot of what I made the music about is experiences I had when I was really young. And you know, when you're that young, you're not aware of the world and you kind of think everything's just happening to you. And then so having the music come out and seeing like comments on the videos or whatever being like, \"Oh, I also experience that.\" Like it's um yeah, it's really cool. It makes me feel less like alone as well, honestly. But I think also like the shows like I I made a lot of this album with like the shows in mind. Like after having toured especially in America for like a year or two now before making this album I kind of had more of a sense of what I wanted what kind of music I wanted to present at shows and then that informed making the music which kind of informed the way the shows were set up and they're a lot more together than I think they were before. So yeah, I don't know if that makes sense but >> No, it does. I mean, getting into the sort of music that you make beyond, I guess, kind of like the usual genre tags that I and many people have like put onto it. I mean, get a little bit into whatever you could call like the girl EDM ethos, you know, like is this >> something akin to what people maybe online would frame as like girl dinner or girl this or girl that or is it like some other completely different thing? I actually kind of hope it's a different thing cuz um I I don't know if I really like the self-depreciating like girl joke like um that's I mean it's >> it's not a self- aacing label. It's something else. >> Yeah. No, definitely not. Like and like no shade to anyone's humor if you if like for people >> Yeah. No shade to anybody having girl dinner right now while watching this. We don't want anyone to sort of feel guilty over their meal as they're watching this. >> Yeah. No, absolutely not. Eat what you want. um be but I think um yeah the well godam came from was actually my first headline show in LA last year >> and the lineup was me and Magna Carta uh Izzyina and DJ Dave and the green room was like all girls I think Matt my manager was like the only boy in the whole green room and we were just kind of joking about how like we were like I feel like we're at an EDM show and it's all girls here and you that doesn't really happen. So, we were just joking that it was the girl EDM show and um it kind of stuck and we just kind of kept using it as a joke and I had an EP that needed a title and that felt like the right title for the music. I think I put something on my story like I'm gonna release some girly DM and like that was before it was the title and a lot of people kind of replied to it and yeah I just kind of went with what the people seem to want I guess. >> I mean labeling your music in that way and also kind of like singing about these personal and sometimes very quiet experiences that you're referencing in the songs the way you're portraying yourself on the cover. I mean, you were kind of referencing this earlier, but getting into it further. Are you seeing that like there are a lot of people getting into the music because they directly relate to the stories that you're telling and the sort of like lifestyle that you were living at one point as a young person who was maybe just like I don't know looking back at it retrospectively online quite a bit and kind of like exploring the world through that portal. >> Yeah, definitely. And um I you know I don't think that my album and like what I'm saying with it is necessarily like super new or groundbreaking and you know like people have said that before or whatever but it's I mean maybe it's kind of like in the last few years the first time my generation has been kind of like old enough to like look back on their life and like say something about it. So yeah it's um it's cool. It's yeah, like I said before, I just when you're a kid, you just think that you're like the only one in the world who's like playing this video game right now because the people immediately around you aren't playing it and you don't know that there's like a whole other world of people that are um you know, and I wasn't really like online like that as as a a kid. I wasn't really on social media till I was in high school, which in Australia is from 12 years old. I know it's different in in the US, but uh yeah, my my online usage as a kid kid was more just like a bit of YouTube and game forums like looking up how to beat this part of the game, you know what I mean? So, I wasn't like interfacing with other real people and and kind of realizing that we were all having the same experience. It wasn't until Yeah. getting older and and then yeah, making these songs and especially on the the iPod touch uh video cuz that song is probably the most like nostalgia baity on the whole album or or Info has it even. They're like the most kind of literally about experiences I had when I was younger. There's some really sweet comments on there about people who feel seen by me making music about that experience. I mean, there's some Tik Tok trends now that are saying like the iPod's kind of coming back, the iPod, the iPod touch. Like, people are kind of favoring that over the the wide access to everything that they get through streaming and are instead sort of like focusing more on kind of like personalizing things to their taste and wanting to kind of like re things in a little bit. >> Yeah. Well, totally. Like that's why it was so um huge for for me I think like go cuz I had an hour trip to school every day on the bus and I didn't have the internet and I just had the songs that were on my device and you get to know the music so intimately because it's all you have access to and you just listen to the same music for like an hour and then you'll go home and change the songs over if you have time. But then if you don't you're listening to the same songs the next day. So it just the the music when you spend that much time with it like seeps. so much deeper into your brain versus just kind of like skipping to the next thing that you have. And um you know, obviously it's awesome like now I love like being able to have the internet all the time and discover everything and stuff, but there was something special about that. So I get why it's coming back. >> Yeah. But I mean kind of digging into that more there as as much as your album is about the internet, it's about technology especially during you know that adolescent era. I feel like on the songs you do express like feelings and thoughts that come across like you're kind of almost poking fun at the way this stuff is kind of like seeped into every element of our lives or you express even like a little bit of skepticism about like how present it is in all of our lives. Um even you know with like [ __ ] my computer which obviously like it it sort of seems like you're just being so over the top so hyperbolic. I mean, you know, do you feel like there are moments where you kind of sit there and check yourself and just sort of think like, man, maybe I'm putting a bit too much of myself into my computer and I need to like reel it back or I need to kind of like hide some things or not share everything or just sort of limit the amount of time and presence this technology has in my life on an everyday basis. >> Yeah, I think so. I probably feel more positively about it than not, though. Um there's there's definitely times like I mean [ __ ] my computer is more about making music as well. I think um the the idea from it came because I had an idea in my head and um I was I couldn't use Ableton fast enough. Like I couldn't get it out as fast as I wanted and I felt like I was losing it and I couldn't transcribe quick enough and I thought if I just could be like one with this laptop right now, it would just be there and I wouldn't like it would be >> a perfect literal translation. And that was where the the idea for that song came from. it. But yeah, I I don't know if if it's if I have ever felt super negatively about it or like I need to reel it back because a lot of the idea with this music was that I feel so grateful to have live in this time and live this life where I get to do this stuff and I couldn't do it without my computer. There's definitely moments like on the last song there's like a lyric that's like I'm always at the desk in the dark because I just spend so much time with my laptop. But um >> but I think it's cool honestly. I've been on tour for a month and I've hardly touched it. So it's been a nice break cuz you're >> out in the real world. >> Exactly. Yeah. So um but it's cool cuz now I miss it and I'm ready to go back and make music again. >> You're ready to just be chilling back in front of the computer again by yourself. >> Yeah. Exactly. But I feel honestly more positively about it than than negative. And um maybe because I feel like I share a healthy amount of myself and it's it's mostly a music making and discovery device. So >> where where do you feel like you sit in the midst of like all the debates going on right now in terms of like how much we see technology, the computer, AI as well like stepping into the creative process, you know, and people just generating songs whole cloth out of nowhere. I mean, obviously you do take some sort of joy or you feel some kind of appreciation on a song like Sing Good, for example, where you're like, \"Yeah, I don't sing great maybe, but like the fact that I have this tool here and the ability to do X and Y and Z allows me to sort of like make the music I want to make, you know, and sort of express myself in the way that I want to express myself.\" And, you know, obviously I'm sure you've experienced either online or in person, like, you know, you have your purists out there who are like that thumping, grinding, you know, pulsating EDMs. It's not music, you know, it's not this, it's not that, unless it has a some [ __ ] like that, you know. So, I mean, obviously, you know, there are people who uh have kind of closed themselves off in that way. Um, you know, but then there are people who obviously see a lot of merit in what you do, but uh don't see a lot of validity behind a lot of the AI art and images and music that we see proliferating on the internet now. Like where do you feel like that boundary is for you in terms of like how much technology can encroach upon the creative process? How involved it should be before you know it starts to maybe lose maybe what we perceive to be as like the soul behind the song or the music. >> Yeah, totally. Well, I mean I just definitely want to say that there was no AI used >> I didn't think so. I didn't think so. But thank you for specifying. >> Yeah. No, of course. Yeah, there's no AI music on. >> No slap on this album. No. No slap at I think I like worked too hard to let that be like a speculation. Um, even the cover art, a few people have been like, \"Is this any of this like generative fill?\" It's definitely not. >> I I But one of the things I love about the cover art is that it does look like one of those weird images that trick you out on the internet where it's like, \"Look at this and see if you could recognize a thing.\" You know, >> that's where that was a reference, >> right? It does look like one of those at first, but then you actually can like dive into it and like look at each individual sort of like item throughout the and and we could talk more about like the different references and bits throughout it. But, you know, it's like where do you feel like that breaking point is for you in terms of like how much technology gets involved in your creative process? >> Yeah. Yeah. Well, I mean with AI there's like, you know, the the copyright and environmental issues. All of that aside, the the I think that the saddest thing about it with like in terms of making music is uh the most fun thing about making music is bumbling around and making mistakes and not knowing what you're doing and just like making a bunch of rubbish and then put I don't know like for me like making music is kind of collaging just like different things from my life and and it's >> all of the exciting like breakthroughs I've made with songs have been by accident and and I've even just from research and stuff like there's a a song on my album called Cyra and it's about the first computer that made electronic music and it was an Australian computer and um I was reading about it and it you know it wasn't made to make music it did it by accident. So, all of these cool advancements in technology seem like they've come by accident. And it's it's just a little bit heartbreaking when uh you know, it seems like people want to skip that step and just kind of have the the final product. And I mean, I get it if you're like just a music enjoyer or like consumer and that, you know, the concept of just being able to like snap your fingers and have your favorite song in front of you is cool, but I just I think people like music for more than how it sounds as well, you know, like like people like an artist because they have something to say or like they're interested in their perspective and stuff. and and I I don't think an AI can really have a perspective because it hasn't experience like there's no it doesn't have any like context for the world and life and stuff. So yeah, I think that's for me at least that's like the saddest thing about it is it just seems like people want to skip over the step of like discovery >> but just the reference points as well because when I was digging into the record I didn't know about the Cyra computer at all. I mean, you know, even pulling that onto the album, I mean, is is beyond like the technological history there, is is there like an Australian point of pride there, you know, and also kind of like referencing that >> on the album? Yeah. >> Yes, absolutely. Yes. I I feel like I wanted this album to be like Australian dance music like Yeah. Um even like the the iPod touch video was shot in my hometown, which is a couple hours away from Sydney. And um and and cuz I guess so much of why how do I say I think I I don't know if I would be like the the producer that I am or whatever if I had have like grown up in in a city or something where I was really stimulated like >> so much of >> my imagination or whatever was developed I think from the absence of stimuli from having like growing up in a small town town and and using the internet, >> you got to keep yourself busy. >> Yeah, exactly. So, that was just kind of looking back and on my life and and being like, oh, that's kind of made me who I am now. And and that was a big point of inspiration. So, I wanted to have that in the visuals and and like there's a a few references to the bus and like that my bus was bus 64 and yeah, so I definitely wanted it and and even like sonically, the first song I made for the album was All I Am. It's not the oldest song, but it's the first song where I felt like this is for the album. And up until that point, I was listening to so much like Panau and Empire of the Sun and the presets and I was trying to like absorb the Australian dance music cannon and stuff. So, yeah, like I I wanted it to be a little bit Australiana, but not in an on-nose way, just like a cuz I'm Australian, I guess. Um, I can't like ignore that piece of my life if the album's going to be about my life. >> I mean, when you started to like kind of branch out creatively and put yourself out there onto the music scene, I imagine sort of like more IRL than than online. Where did you find yourself? Because I mean, at least like from an outside perspective, I mean, in terms of like a lot of what we talk about over here. Um, and I mean, as you know, like a lot of Australian music makes it over here these days. Um, you know, it's like the psychon garage rock scene, it's tame and impala, you know, as far as like a lot of electronic music goes, it's flume, you know. I mean, what is the EDM scene like down there right now currently? And, you know, is is that something that you found yourself ingrained in if it was there for you to kind of flourish within or did you find like a lot of your creativity flourishing and getting a reception online more than like in person or locally around you? Yeah, I think it's been hard to say and also because I wasn't really observant of that kind of stuff because when I was first putting out music and making music and even first getting any attention for it at all, I wasn't trying to like I wasn't really trying to like have success or like make a splash or you know, I was just it was my hobby and I was just doing it because it was fun and it felt good and stuff and then if people liked the songs and and I got got show offers, I would do them. But I really had no idea what I was doing. It was I was just like, well, I like this and it's working, so I'm going to keep doing it. Like I didn't know anything about like being an artist or what, you know, I don't have any like friends or family in the music. I just didn't know anything and I didn't care about that kind of stuff. Uh, I think all of I mean aside from um Flume who's been like a hero of mine since I was like 12 or like he's just you know he's been so huge in Australia for so long especially yeah for I've been to so many of your shows he's awesome. Um there's a lot of my like musical heroes have kind of come from overseas and and the kind of music that I am super inspired by like wasn't really big in a it's still not super big in Australia. It's like maybe bit more unders. Yeah, I don't know. I guess uh it it probably I probably felt like I was part of more online communities than like Australian music communities until maybe recently, I guess. But it's it's hard to know. I don't know if I step outside of myself and look at this stuff enough to really have an informed opinion about it. I just kind of make music and hang out with my friends and go wherever I get like invitations, I guess. >> Well, now you're starting to also get like some Arya's nods and uh you know, nominations, correct? I mean, you know, what's that feel like? And I mean, you've gotten >> you've gotten so many uh you you've got to win one of them, right? Like are we anticipating some W's coming award shows happen? >> It kind of would be crazy. I feel like you've increased your chances, you know? It's more than just like one, you know? >> Yeah. I mean, if if like I don't know. I I didn't I had no idea making this like, you know what I mean? I just It's kind of like I said, I feel like my music is exist existed like in more online spaces for so long. And I have never felt like the kind of artist that would be nominated for those kind of things cuz it it >> I I don't know. It just doesn't really like happen for the kind of music I make. But it's really cool. I'm so grateful. I mean, I hope one would be amazing, two would be cool. I mean, you know what I mean? I'm just I'm just like super grateful for the for the nomination, but um you know, I release on like a on an indie label, NLV Records, and we've done it together since I was like a teenager, and I have like a it's not many of us working on this stuff. So, it's just cool. Like, that was just so random to happen to all of us together. And I'm grateful it was with the the team I've always been with. I I don't want to get you in trouble, but I I wanted to ask just, you know, given all the like kind of technological nods across the record, have have you ever hacked anything? You ever have to hack into a mainframe? >> No, I never, >> you know, you know, open up a program up, pull something apart like that. >> No, I really haven't. you know, I was actually kind of um when I was about like eight or something, I went I really wanted a pet bird and I never had one, but I went through this phase of really wanting a pet bird. So, I was just googling stuff about how to take care of them to be like, \"Mom, look, I know what I'm doing. Can we please get a bird?\" and I got a virus on the family computer from like like bird research and it it really scared me off any [ __ ] like that like ever again. Like I was not even really torrenting or like pirating. Um so I'm not a hacker. >> That's that's the most innocent thing. You've caught a virus. >> I know. Well, that's why it scared me off. I was like if I can get a if I'm going to like, you know, [ __ ] up the family computer from bird research, I better not be going any deeper than that. You know what I mean? So, yeah, it really scared me off. I'm I've never been a hacker. It's just not in me. >> Given your view of the computer as like a tool for exploring music and experiencing music, like what are some of your earliest music memories that you can recall, computer related or not? >> That's such a cool question. Uh, the song Love at First Sight by Kylie Manog. >> Okay. >> Um, I remember >> Australian queen. >> Yes. My mom is a huge Kylie fan, so I grew up listening to Kylie all the time. And I remember it really vividly cuz I was super young. And my mom told me that when she saw me, it was love at first sight. So that has always stayed with me. I have a lot of memories of listening to the radio in the car with my dad. >> He's a he's a big radio listener. And um earliest I'm trying to go way back. Uh, the song Forever by the Veronicas, that was huge for me. That was probably like one of my earliest favorite songs. >> Um, I think Don't you by the Pussycat Dolls I was obsessed with and my mom had >> was so big when it came out. It was huge. >> I was so obsessed with I was like 5 years old. I think it was my first day of like kindergarten and my mom had it like the single on a CD and I brought it in for show and tell and I was like this is my favorite song. I don't know if I have any computer related u music memories. The the first time I made music was on Garage Band on my mom's iMac when I was eight or so. I was just messing around. I would like record my I played the clarinet in the primary school band and I would record it through the mic and the metronome was playing in the background cuz I didn't know how to change the tempo and yeah. >> So you're just stuck on the preset tempo on no idea about anything, you know, it was just fun. But um that's probably my first computer related music memory. Are you still like, you know, carrying any of the clarinet chops with you? No, unfortunately. I haven't played the clarinet for >> Has it has it been or could it be in at some point like a sample on something? >> Oh, absolutely. I would love to like um Yeah, audio is so awesome. Like audio in the sense of Yeah, like any kind of scrap recorded sound like a >> Yeah, I I don't have a clarinet on me, but yeah, I would love to record my >> Oh, yeah. I wasn't going to force you to perform right now. Don't worry about it. Like I wasn't here to check in on your, you know, your clarinet abilities. I promise. >> Yes. It's been a minute. >> I also wanted to ask you about like uh some of the imagery that you've worked into the album cover over here and also kind of like pops up in some of your music videos. Um one of the most prominent of which that I find to be very curious is just kind of like the um the 5G tower pictures. Like I mean there are some contexts in which that is like a very dark scary ominous thing you know like in kind of like pulling on that thread. Are you looking to trigger some people get some conspiracy nuts in your comments like you know for the for the Tik Tok engagement you know it's like does does the 5G tower does the shadow it casts onto your life is it a dark one or is it just like that's a fun cool thing? No, it's more of a funical thing. I don't feel like I'm a very controversial person or like, you know, I would >> You weren't wearing a tin foil hat around 5G tower in the music video. You were It was almost like a loving experience. >> Yeah. No, totally. Well, I think like probably about mid 2024, which was when I was I was still like releasing Girl EDM and stuff, but I was starting to think about the album. made a couple songs for it and I was just starting to see them everywhere and think that they looked so uncanny and you know it's like if if you'd never seen one and you were driving along and you just saw one popped out of the ground you be like what the hell is that? But because they're everywhere, no one really like looks at them or think about them. But I don't know, I just started to notice them all the time and and the different kind of colorways and silhouettes and, you know, of the the the cell towers. And then once I realized uh my album was about my computer, I started to um think about ways that I could kind ofify it. And I made up this kind of head cannon about how maybe to a computer the you know, like that's the access point to the internet. and like um you know maybe to a computer that could be like something akin to a church like a place of worship that's you know they're everywhere all over the world and um yeah I don't know I just kind of started to try to think about them in how would they fit into like a fantasy novel or like what else could they be I guess and um a lot of it's like just fun and silly there's no I'm definitely not trying to like conspiracy bait or anything like that I also just think they look cool like But like a lot of um >> a lot of like grotesque manmade like everything was made by someone, you know what I mean? And they like I know that they're purely made for like functionality or whatever, but they also just look kind of sick. Like they look like the the kind of thing that you would someone would draw up for like a a sci-fi novel or something. Um yeah, I just imagine if you'd never seen one before and then you saw that, you'd be like, \"What the hell am I looking at?\" But they're everywhere and I just thought they looked kind of cool, honestly. >> All right, not to call you out, but I I have to imagine your room doesn't actually look like this. Like, so so what here is like real? What here is staged? And like, you know, is is this a reflection at all of like I don't know, maybe a love of hoarding, you know? It's like is is is there something about the complication and just the clutter of this that you feel like is representative of something that you personally experienced? >> I think when you said before when you're talking about those images where you can't really identify anything, that was a major reference for this picture. But um I I honestly just kind of wanted to >> fit as much of my life as I could into the image. My room definitely doesn't look like that. I don't live like that. if you moved the frame like that was definitely a set like it was you know there's a few things that are kind of edited in like for example that shirt doesn't actually say ILMC it says rabid but >> Oh okay like those kind of things you know we there's a few little um I think the CRT it says cyra on it okay >> didn't actually it said teak or something so there's a few things like that that are that are edited but it's um it's yeah we set it up like that if you moved the camera like a you a meter to the left. It would be a tidy room. Empty room. No, fully. And um >> Right. >> But it was cool cuz it was in my actual room, so we could afford to leave it set up like that for multiple days and just like rearrange it and shoot it again. And >> cuz I mean there's like some older keyboards and tech and screens in there that like you know you'd have to go to the thrift shop or something to get like your hands on. Is this stuff that like has always been around in some capacity or did you need to go out and find it and then sort of like, you know, bring it back and use it or tinker with it or kind of incorporate it into your life after you had found it somewhere else? >> Yeah. Well, most of the stuff was already in I'd say probably at least half of it was already in my house. Like my actual laptop is in there. A like my clothes or whatever. A lot of it was borrowed from friends. Like probably about half of it was just >> what do people have around and um and stuff like that. So, uh, yeah, it it it was all just yeah, sourced from wherever, but it, uh, you know, we didn't it it wasn't like an expensive shoot. We kind of just used what we had around and borrowed stuff and and got it together. But, yeah, we it it was just we were fortunate that I could, you know, do it in my house and mess it up that way cuz it took so long to set up and if we, you know, if we did it in like a studio, you'd spend the whole day setting up, be like, \"Quick, get it. Got to pack it down.\" But yeah, we got to play around with it, which was really cool. >> Keeping that in mind, where do you feel like your personal connection with storytelling and kind of sharing with the audience is going to continue? You've kind of given them a big slice of your life during this certain moment in your youth and your adolescence, like what sections of your life or your existence you kind of see yourself telling stories about about going forward from here into the future as you write more songs? H it's hard to know because well I mean nothing on this album felt hard to share. It was all like none of it's really like embarrassing or like maybe delete is a little bit vulnerable but otherwise it's >> it all felt pretty >> easy. I think I probably just have to, you know, go and live more life and like put more like fruits in the juice machine to, you know, have something to transcribe and stuff like that. But I really am excited to make another album. I've seen people, especially dance music artists and stuff, talk about how making an album was really hard or exhausting or it's not worth it and it's easier to do singles these days or whatever. But like locking in and making an album has totally changed my life and it's been this awesome medium for expression that I, you know, I couldn't tell that story with one song or two songs. It's like all of them put together. So, I'm so excited to make another album. I don't know what it's going to say or sound like. There's a few songs that didn't make it onto this one that I hope have a life somewhere. But yeah, it's still I released it and then went on tour straight away. So once I get home, I'll probably be able to stew on it a little bit more and know what is going to happen next. But I don't know. I just am excited to make another album honestly. >> Yeah. I mean what you just kind of described there in terms of like what other EDM artists are doing or thinking in terms of like their output that that does sort of seem to be the norm. like do you attribute that to I don't know what the audience demands are of electronic music as opposed to audiences for other genres or maybe just sort of like the economy around the genre where artists aren't being made or broken by whether or not they drop a full length album and it's more about sort of like how many live sets you can play and so on and so forth in order to kind of like make a living. Um, is is there something about making an album in your experience as an electronic music artist that isn't as economical as just like kind of focusing on singles and performing? Yeah, I think it's probably a genre thing and it's a little bit different because you don't really see like rock artists being like, well, maybe you do, maybe I'm out of touch, maybe, but I feel like you don't as much as dance music see artists from other worlds being like it's all about singles. Like everyone's totally doing albums. I feel like there's there's not really any artists who have had like a longstanding impact that haven't released albums. >> I I think a lot of rock music is does still like culturally revolve around the album cycle. And I I think that's part of the reason that the genre has like kind of shifted in the way that it has in terms of its significance. We because we don't exist I think in an album sort of paradigm in terms of like what drives popular music per se. artists still drop albums obviously, you know. Um, and I I think it has changed back a little bit, you know. I think since like >> the mid2010s where it sort of seemed like the playlist was the new shiny exciting thing. >> Um, and I I think it still continues to be in a big way. That has changed a little bit as people I think are getting like less and less exciting experiences through just like kind of only listening to playlists. and and I I think that is kind of like you know creating a bit more excitement around albums once again you know so it is kind of like a bit of a pendulum swing you know in the other direction not like one that's so radical that people are just like throwing their playlist in the trash you know like playlists are probably still not going anywhere like you know broadly speaking but um I I think people are looking for maybe more focus and more curation and albums provide that when an artist actually thinks about like the sequence of the record and they actually care about how the album moves moves. >> Um, I I know you've talked about this before and I still want to pick your brains a little bit longer. Um, what kind of thought did you put into the sequencing behind this record? because it it does seem like that you put a lot of work into the way the songs progress. Uh, you know, aside from sort of like what slices of life we're getting from the feelings that you describe or the experiences that you describe on specific tracks, what do you feel like the album in a macro picture kind of says about, you know, you personally or kind of like the character portrait you're trying to paint? M yeah I think um well I just wanted to say as well on the last point about like EDM or whatever as well with like albums and singles it it feels like a maybe a functionality thing as well with like where a lot of dance music is made for the club and like for the dance floor and it's not meant to tell a story. It's just meant to like make people move which is so awesome. Like that's such a cool thing that music can do. But I get it for those artists it doesn't make sense to make an album because they're not necessarily trying to tell a story. They just want like the one song that's on everyone's USBs and everyone's playing it like and that's the >> the like dance track of the year. So I just wanted to say that in case anyone thought I was like shading EDM and their like release process or whatever. Absolutely not. Yeah. >> It's just a a different like kind of expression I think. Um but uh yeah, I've put so much thought into the sequencing of this thing and um in every like interview or whatever I've done, I've I've like said, \"Can like please listen to it from the front to the back cuz um yeah, the order changed so much.\" And the I wanted it to kind of feel like a bit like a DJ set. Not entirely like not like I love the way Skrillex did it this year with his album. was so cool, but I didn't want it to be like that extreme. Um, even though I love that, I still wanted it to feel like every song >> could be played from start to finish and feel like its own song on its own. But >> it's basically when I had the songs all kind of 90% done, I would lay them out like the MP3s in Ableton and then just like play and see how the transition sounds between each moment. And then some of some of them I would be like, \"Oh, that sounds whack.\" So I would go and kind of like retcon it with like for example between Cyra and Delete there's a transition that both songs were done and then I felt like they sounded weird like that this two songs are super different and they it sounded weird going from one into the next so I just went back into the and that's what's awesome about like being a producer is like you know I just hit export and the song's done like from my computer I don't need to go and ask >> someone to change it or you know like I don't need to >> try and give instructions or I can just do it. That's what's I love about computer music. But yeah, I just go back and actually make the transition, re-export it, put it back. Oh, okay. It sounds good now. And just do that for the whole like placing sing good was so annoying because it was like the only song that doesn't have drums and it's a low key. >> Yeah. So, there was so many points I was like, ah, it just feels weird there and then it's hype again and then it's oh, like it was such a problem. But then I changed the end of Battery Death. So it had a soft fade out and then the start of its youu has Darcy's guitar and that was it. It fits finally. But yeah, it there was a few changes to the track list for sure just to accommodate that cuz that's how I wanted it to feel. >> What were when you were crafting this album? I mean you you talked about like some certain songs or singles that were like big for you as a kid. Were there certain albums that when you were putting this together were kind of like a reference point for you in terms of like this is what a good sequenced a well sequenced album feels like, you know, um uh in terms of like, you know, some albums that you enjoyed listening to from front to back when you were younger. That's a really good question because yeah, I did listen to heaps of albums and also just yeah, albums that I grew up with where I felt like I enjoyed every songs and there were no low moments because for me like you know I know everyone's taste is different but for me I love every song on my albums. I wanted it to to feel like I know every not everyone loves every song but I made it for me you know what I mean? So I wanted it to feel like I like every song and stuff. So, one of my favorite bands ever is AltJ and um their first two albums I listen to, I mean their whole discoraphy is great, but especially their first two albums when I was in school I listened to so much and >> I love every like that an awesome wave like their first album I just it's like seared into my brain. I've listened to that album so many times. Um, so that was like a I know it doesn't sound anything like my album, but it was a bit of a reference for crafting an album, I guess. Trying to think of >> some others. Um, Two Star and the Dream Police that came out. It it just came out around when I was working on this and I was listening to it so much and it Yeah. >> feels like an like an album. I'm trying to think Currents by Tam Impala. Mhm. >> Um, >> yeah, a lot of it is like not dance dance dance dance music that I was I'm trying to think what else. >> I mean, it's it's not dance music, but it's like kind of showing you an example of like what's good album curation, you know? It's like all the songs like >> on all those records like reinforce each either they have an interesting progression to them or they all like reinforce each other really well, you know? So it feels like you're almost >> and I would say this is the same for your album like you feel immersed you know in a certain like sort of world that the artist has built for you >> and it's kind of at least >> in the case of uh some of them it's producer music as well even if it's not um electronic dance or I don't know everything blends and stuff but but um I wanted to make a good one and listen to a lot of good ones and see if I could get anything from them. I I think you have and I appreciate you taking the time. >> Yeah. No, thank you so much. Um yeah, thanks for supporting my album. I appreciate it. >> Thanks for making an album worth supporting. Thank you.",
    "https://www.youtube.com/watch?v=Lqaq4lVwuVQ": "Disclaimer. I do not condone smoking in any way whatsoever. Do not smoke. I repeat, do not smoke. Make the addiction has made my life so much worse and I would wish that anyone and all addictions smoking in this video is going to be intended to break smoking as stupid. If you're currently smoking, quit. If you don't smoke, don't start. It will ruin your life again. Don't smoke. [Music] Oh, hey. Didn't see you there. Oh, this uh Newport. I like to keep it cool. Just kidding. Never actually quit smoking. We could even say I'm an expert in quitting smoking. I've done it five times already. [Music] Somebody dropped a sig there. Crazy. I'm just doing my part for the environment. Me and nicotine go way back. Well, not that far back, actually. Like millions of others, I started vaping in high school. They must have diffused into my system from the bathroom air. Later, when I visited Europe, I couldn't find any vapes. They were only selling cigarettes and this weird looking thing. So, I figured went in Rome and bought a pack of six. And curiously, I discovered that the packs look a little different there. Oh, thankfully, I don't speak French and neither should you. So, who knows what they were trying to tell me. From then on, whenever I couldn't find vapes, I'd buy some sigs, which eventually became its own habit. And just like that, I became a chain smoker for the next 5 years. Thankfully, I've quit. This was just for the bit. So, look, I don't buy them anymore. And though I may fold and bum a stick from someone when I'm drunk, that's pretty rare. I don't go outside much. And also, drinking makes me pink and gives me a headache. So, there's at least one vice I don't have. Heat. [Music] [Music] Heat. [Music] Anyway, is it just me or does it seem like people are starting to smoke again? The data says no. Smoking has decreased significantly over the past two decades. But then why does it feel like I still see it pretty often? I think this post is pretty insightful. One possible explanation is a sort of sampling bias. For one, drinking is often paired with smoking, but also some of the people you see smoking may be doing it in part because they are being seen. Parties aren't exactly known for genuine behavior, and neither is social media. So maybe some people perform smoking more than they actually smoke, and they're more likely to smoke when they are being seen, thus a sampling bias. The thing is, besides being a stick of cancer, a cigarette can function as an accessory. The marketing strategies from the 20th century were so successful that you'll still find a cigarette in every other student film made today. They don't even have to pay for product placements anymore. By now, the image has been solidified. A cigarette is cool, edgy, perhaps even sensual. They carry a certain aesthetic that alternatives can't offer, and people are well aware of that. It can be part of a certain look or vibe. You may find a marbor fastened between the bejeweled fingers of a bushwick man or silver lake manipulator combined with a crop tea baggy pants half sleeve burks and a carabiner to harmoniously create a giant red flag that you'll probably ignore. Or maybe it's a part of a blue collar cosplay or a cowboy look or a wife look or a dark academia look or an indie slaves look or whatever. And some may call this being a poser. A true addict will gatekeep a fake addict from their prestigious addiction club. You don't really smoke like that. You're barely even inhaling. That's just a prop, loser. Which is funny because it's a pretty costly performance both on your wallet and your health. Is a cancer really worth the aura? I feel like it could only be in the 21st century that someone can be accused of faking an addiction for attention. And that accusation possibly being correct. [Music] [Music] I'm >> Oh, hey. Didn't see you there. Oh, this. Oh, just my annotated copy of The Critique of Practical Reason, long anticipated sequel to The Critique of Pure Reason by Emanuel Kant. I was taking notes on my phone. Isn't reading great? Isn't it normal to like reading? Well, apparently not. Because the immediate assumption when someone is out reading in public is that they're faking it, being performative, virtue signaling, trying to be a vibe, a pickme. Lately, there's been a lot of talk about performative males online. People have caught on to the current meta male manipulators. But unfortunately, this time around, their features are things that I actually enjoy, but now I have to be self-conscious about it. But I swear I'm really not like the others. I actually make my own matcha. Pick me. I think it's important to recognize that this is nothing new. There have been male manipulators since the dawn of time. They've left their mark on literature and folklore, for example. Vampires, demons, nefarious creatures skilled in charismatic performance. As someone well into their 20s, I can assure you that this is just the latest version, and there will be other iterations of performativity, RZ, and aura every couple years or so. Speaking of which, I feel like the way that aura has entered the common vernacular makes a lot of sense. It just makes explicit something we've always done. Trying to appear cool or attracted. Aura points just puts one's perceived desiraability or coolness into theoretical units that can be measured like a currency. You can even go into a debt and require years of backbreaking labor to recover financially. However, preceding aura is attention. If you do something cool or stupid, but there's no one around to see it, you don't really gain or lose aura unless it's recorded and posted online, therefore drawing attention. So in a way aura is derived from attention and like aura attention is also a sort of currency. Indeed we pay attention. You can even have a chronic deficit of attention. We all want attention to some extent. Someone's attention is a prerequisite for any sort of compassion or support. A crying baby is attention-seeking so that it doesn't starve. What a loser. >> [ __ ] dumb baby. >> Advertisers will pay real money to buy your attention. Speaking of which, this video is sponsored by nobody. Apparently, smoking is not advertiser friendly, but you should check out my brother's shop in the description. He sells cute accessories of original characters, perfect for a pick me like you. [Music] Anyways, your attention is extremely valuable. Even if you are completely broke, you still have your own mental real estate, which someone out there is willing to buy. Even Discord and WhatsApp are starting to include ads. So if aura and attention are like currencies, then it's natural that one can be too greedy for them. We can all tell when someone is begging for attention. It's unsightly. By now, we're very sensitive to what is genuine behavior and what is performative. Hell, people beg for negative attention, too. Being a contrarian or a nuisance, or rage baiting on the internet, making it hard to tell whether someone is stupid, evil, or just desperate for impressions. Some will go to greater and greater lengths to get attention like they're chasing a high. So maybe attention has its own forms of addiction too. Can I see you as my cr. [Music] Oh, hi. I just took a rigorous shower cuz smoking makes you stink and gives you acne. Fun fact, I don't know you. That is the biggest reason I started making videos in the first place. You see, in real life, I'm pretty quiet. Some would say shy or perhaps sigma. Inside me, there are two wolves. Their names are social anxiety and attention-seeking, and they're making out. Back then, although I was debilitatingly afraid of being lame in person, I didn't really feel that way online. I felt like I could talk and be weird and be heard without really getting worried. Sort of like how it's easier to spill your heart out to a stranger on the subway than to someone you actually know. And so, I made video after video and bask in this ever growing source of risk-free attention. And though I could still get insecure, that all stayed online. Well, at least that was the case. But it turns out that once you build a sizable audience, there's a good chance that someone in real life will recognize you, especially on a college campus or major city. Not to brag or anything, but I've taken my fair share of selfies with people. I've also had my picture taken in secret. People have also found my phone number. Some also investigated and shared private details about my personal life. And they've also spread many rumors. Again, not to brag or anything, but I only had a handful of mental breakdowns over the inescapable feeling of being seen. And I only cope by chain smoking on even numbered days and weekends and national holidays. My point is you can in fact get too much attention. Attention can be a bad thing. You've probably experienced this yourself, been stared at without wanting to be or caught in an embarrassing moment or perhaps you've been gossiped about and at times even wanted to be invisible entirely. So that whole experience of mild YouTube success really made me develop an aversion to being seen. I stopped going outside. I stopped using social media. Social anxiety and attention seeeking had a painful separation. But now it's been a good four years since I've had an internet presence, which is a surefire way to no longer be relevant to people. So perhaps my tolerance for attention has gone up again. Social anxiety and attention-seeking had a tearful reunion. I'm really dragging this out. I'm going to stop with the wolf stuff now. But my point is, I'm back to making content. [Music] Can I see what's my crush? I will not. >> But what is a content creator? Well, one could say that content creators are in the business of attention. A free platform like YouTube makes its money by selling your attention to advertisers. Accordingly, content creators are paid based on how much of your watch time they can get. Functionally, social media is like a marketplace. The platforms own the real estate, the vendors are the content creators, and the currency is attention. Essentially, attention-seeking becomes one's livelihood. Some thrive in this kind of environment, doing anything and everything to stand out in the crowd. But for others, it can easily feel degrading, like you're some sort of circus animal, always trying to think of new ways to surprise people and keep them in their seats, especially in the middle of a longer video when people start to lose focus. Anyways, the market offers a variety of goods. It's kind of funny how short form content has taken over the bottom tier. YouTube used to be the silly stupid way to waste time, but now it's become something a bit more serious. You put on a YouTube video when you have a sufficient amount of time to kill, perhaps a length of a meal or a poop. Otherwise, you just scroll TikTok or whatever. Honestly, I feel like the YouTube meta shifted to longer videos precisely because short form content took over its original niche. Accordingly, movies and television feel even more serious. It can feel like a herculean intellectual achievement to sit through an entire movie without looking at your phone. So, there are levels to the media we consume in accordance to how much mental bandwidth it takes to consume them. You could even convert between them like compiling short form into medium form or cutting medium form or long form into short form. Essentially, the market has produced every sort of content imaginable to take whatever amount of time and energy you have available. And even when you're off the apps, they'll try their best to get you back on there, literally begging for your attention. Apple and Meta explicitly tried to convince us to pay them to fix screens onto our heads, giving them constant access to our eyes and ears. All >> hail. >> When you wake up, when you brush your teeth, when you wash your face, when you're in the shower, when you're on the toilet, when you're cooking, when you're eating, when you're cleaning, when you're driving, when you're walking, when you're running, when you're lifting, when you're resting, when you're falling asleep, every waking second of your life is up for grabs. Look at mying screen time from a few weeks ago. I had more daily screen time than hours in the day. How is that even possible? This is not normal. I realize I'm sort of projecting here. But basically, I have a content addiction, much like a shopping or gambling addiction, but instead of wasting money, I waste time. But believe me, if I had money, I'd waste that, too. I'm sure we've all fallen into a hypnosis of doom scrolling before. Barely sentient, stun locked as we repeatedly take psychic damage, brain rotting. It can be incredibly difficult to break away and stay away from the feed. And try taking an iPad away from a toddler and see how they react. You do it without thinking. You feel restless without it. You constantly make excuses to get just a little bit more. Literally tweaking. And physiologically speaking, it's not so different from other addictions. And this is coming from a nicotine addict. >> Hey yo, can I bomb one? >> Oh yeah, sure. >> Thanks, bro. >> Yeah, of course. >> Or do you have a scroll? >> Oh, >> thanks, bro. Yeah, >> thanks man. >> Yeah, >> screen addiction is very real and it can genuinely ruin your life. And this was all by design. Addiction is a great business model after all. It's an infinite money glitch. Hence, it is taxed so highly for cigarettes and gambling. For media companies, addiction means returning customers more watch time, more data, more ads, and more money. And so, they made using their services as frictionless as possible, as easy as breathing. You can go from relatively lucid and sentient into completely subdued by a highly personalized feed in a matter of seconds with about two thumb gestures. This all happened so quickly and so quietly that we did practically nothing to stop it and legislation has yet to catch up. It's like if someone put a cigarette in your mouth and lit it. Is it entirely your fault if you inhale and get addicted? Again, your time is truly valuable and these corporations are constantly trying to take it from you and you should be mindful of that. You could spend your time on your phone, but you could also spend it on literally any other hobby. Hell, you could even go outside, look at some birds, talk to your friends. You could even read a book, or just pretend to. At least you're outside. I deleted Instagram last month, and it is truly remarkable how much time I have now. I've been able to rekindle old hobbies like reading, writing, and drawing, and strengthen friendships that I've been neglecting. And I was even able to make this YouTube video after 4 months of procrastinating. It turns out that you can do a whole lot when you add literal hours pack into your day. It can be incredibly difficult to pull yourself away from constant consumption. This was all designed to be addictive, after all. But if you do, I think you'll find that there's so much more life in sobriety. >> Resume viewing. Resume viewing. Resume viewing. Resume viewing. >> Of course, it's not all bad. I could never really live entirely offline. I sort of grew up here. I've learned a lot online. Math, history, editing, redstone, crosshair placement, wave management. In general, I've become a much more informed person because of the internet. Many of us have gone down rabbit holes before, digging through archives to uncover something otherwise difficult to learn. But nowadays, I move through the internet completely differently. Instead of digging down, I stay at surface level to scroll and scroll all to end up in essentially the same place, like running on a treadmill. But instead of moving my legs, I flick my thumb up and down. And instead of burning calories, I burn a 16x9 hole straight through my retinas to sear away all those ugly wrinkles on my brain. Clearly, the free hand of the market has me in a chokeold. By now, large corporations have bought out almost all of the traffic on the internet, like buying every highway in the world and filling them with billboards. People don't even bother leaving Twitter to look something up anymore. They just get the inplatform large language model to give them an unreliable answer. It's become so difficult to move through the internet without being bombarded by advertisements or prompted to give data or forced to train someone's AI. These corporations are trying to funnel the entire internet into narrow channels that can be easily monetized. And so we as consumers have to fight against the grain, swim upstream for it to be worthwhile. Their intentions go in one direction while our intentions go another. What's good for their profit margins is rarely what's good for us. Watch time and retention rates are not actually a good gauge for what's worth our attention. Again, there's still so much good on the internet, accessible information, independent journalism, community organization, mobilization, and resistance, but it's all mixed in with surveillance and suppression, and a whole lot of [ __ ] that distracts, misinforms, or outright manipulates. And suddenly, the burden is on us to sift through all the garbage, which isn't exactly easy under a sort of addiction. And in all of this, good and bad, the ones quietly, reliably profiting, are the platforms and search engines and countless other mechanisms that have been thoroughly engineered to exploit every part of our brains to make shareholders richer. They slowly mutated these technologies from tools to drugs that they can profit off of. But unlike physical drugs, they're not even cool. Your attention is truly valuable and very consequential, much like a currency. We can be very neurotic and invested in how we receive and pay attention to each other, but we're often less cognizant of how we spend it on our devices and give to soulless corporations. Like with any other currency, it's often better to invest it into something long-term and fulfilling rather than burning it on something temporary. Let's not forget how performative corporations are. They're the real manipulators, except their act isn't ambiguous at all. They're companies and they exist to make money. You should seriously be picky about where you spend your money and your time. It's one of the few ways that we still have just a little bit of power in this world that we live in. And if you don't treat it as valuable, someone will take it from you before you even notice. Anyways, thanks for watching. Seriously, I appreciate it. 20 minutes is not a short amount of time. And also, thanks for all the kind comments in the last video. It made me feel less alone and worthless. And again, one more time, do not smoke. It sucks. It will kill you and it has ruined my life. Avoid that at all costs, even though I make it look really cool. Okay, just kidding. Bad joke. It's stupid. It's really bad for you and it's stupid. Don't smoke. If you start smoking because of this video, I will kill myself. Oh, and check out the shop. It's cute. No. Bye. Okay bye. [Music] Okay bye. [Music]",
    "https://www.youtube.com/watch?v=ULKPS8gNk7A": "Should I still move to Japan? I'm worried the country may be losing its identity. A viewer recently asked me this, citing concerns over the economy, immigration, and over tourism. For those who don't know, postcoid inflation hit Japan particularly hard. Past economic policy made it impossible for the country to raise its interest rates. And this caused the yen to plummet in value, which in turn dramatically increased the price of many essential imports such as food and oil and triggered a massive wave of tourism. Everyone who wanted to visit Japan during COVID but couldn't and everyone that could now afford to because of the exchange rate all came at the same time and more and more people have been coming each year since. As a result, certain businesses, primarily hotels and restaurants in tourist destinations have started to set their prices based on what international tourists can afford, sometimes pricing out the locals. In the extreme, this can create areas that feel significantly more international. An example of this is Nisso, a ski resort in Hokkaido, known for its powder snow, high prices, and big crowds of international tourists. These issues, combined with a recent uptick in sensationalist Japan is cooked, Japan is over content, has led multiple people, sometimes in the comment sections of my videos, to express that affformentioned concern about Japan losing its identity. Many Japanese people seem to share that concern. In the recent elections here, the Sansto, a new Japanese political party with the slogan Japanese people first, tied for the most seats gained. The Sonato is typically characterized by media outlets as far or ultra-conservative, and the party has been criticized for making appeals to emotion and changing or backtracking its language depending on the setting. It often acts friendly towards foreigners on more mainstream TV shows, but employs significantly more colorful terminology such as silent invasion when speaking directly to supporters. Many foreigners, particularly those living in Japan, have expressed concern over the sansto. Again, sometimes in the comment sections of my videos, asking Dogen, what are your thoughts on the rise of anti-forigner sentiment in Japan? It's an interesting situation. One group is worried about Japan losing its identity, becoming too multicultural and too foreign, and the other group is worried about what could be characterized as the opposite, a rise in nationalism and anti-forigner sentiment. And as someone who has tremendous respect for Japanese culture, someone who teaches the language for a living, but also as a foreigner that lives here and the father of two girls growing up here, I can appreciate the concerns of both sides. So, in this video, as well as the next, I'd like to try and break things down, hopefully adding clarity to and lowering the temperature of the conversations being had. And I'd like to start with the rise of the sansto because I think it's the topic that would most benefit from additional context. I'll be talking about the new prime minister, Takichi, as well as some other movements in Japanese politics. in the next video. Many media outlets have used headlines something along the lines of new far right-wing party wins big to describe the recent election results here. But do you know how many seats the Sansto holds in the House of Counselors? Well, they gained 14 seats, taking their total to 15 in a house of 248. That's correct. The Sansto, which has been dominating headlines and talked about by some as if it were the new face of Japanese politics, in fact only holds 6% of the seats in the House of Councilors. But how could they win the most seats and not hold a majority? Well, again, they didn't win the most seats, they gained the most seats. Japan has many major political parties, between 6 and 12, depending on how you count. And many of them went into this recent election with a big head start. a head start in many cases so large that even if they lost seats they still ended up with far more than the sansto. This is the first point I'd really like to drive home the relative rise of the sansto is significant but it's incorrect to characterize the party as the new face of Japanese politics. The overwhelming majority of Japanese people did not vote for the Sonto in the recent election and the party is still a far cry from holding any kind of majority. Which brings me to my next point. Why the Sonto was able to achieve that relative rise. In my research for this video, I read a BBC article about the Sato that correctly points out the party built its platform on a Japanese first agenda that warns against a silent invasion of foreigners. It accurately notes that the party's growing popularity reflects unease over immigration and over tourism and that misbehavior and bad manners by some tourists have added fuel to the fire, creating an impression of a big foreigner problem. On social media, I see posts from people who appear to have read articles like this. posts that typically sound either like the sansto is using foreigners to fearmonger hardworking immigrants isn't an invasion or good on Japan it's finally standing up for itself it's finally fighting off the foreigners and woke propaganda to me however both of these statements really just illustrate how much the conversation would benefit from additional context I do think the sansto used foreigners to fearmonger I think they intentionally grouped different kinds of foreigners together because it's politically expedient. It's easier to make the case for a silent invasion if you don't have to distinguish between Johnny Somali and streamers cycling for charity or figurine scalpers and retirement home workers. That being said, I also think if the silent invasion quote is brought up, it's important to expand on that topic because failing to do so may lead people to overly pessimistic conclusions. For close to 70 years, a single political party has completely dominated Japanese politics. The party in question is the LDP, the Liberal Democratic Party. Now, despite that name, it's actually more of a conservative or nationalistic party. And the longest serving prime minister in both the history of the party and the history of Japan is Shinszo Abbe who during his time in office was generally liked by the people and seen as a strong patriotic leader. But in 2022, Abbe was killed, assassinated by a man who claimed that the former politician had ties to a foreign cultlike religion that had caused deep personal harm to his family. While initial reports dismissed the killer as delusional, subsequent investigations revealed a shocking reality that many LDP officials, including the former Prime Minister, AB, did in fact have connections to that group. The organization in question is the Unification Church, what some people have described as a cult-like religion. And for decades, the church based out of South Korea would use front organizations in Japan to gradually introduce Japanese college students to its doctrine. A doctrine that teaches Korea is the Adam nation and Japan is the Eve nation. And Japanese people can atone for their country's past sins by purchasing expensive earns, donating to the church's overseas headquarters, and converting others to the cause. The church also encouraged Japanese women to move to South Korea and marry Korean men handpicked by the church at massar arranged wedding ceremonies. Over time, the organization's activities in Japan picked up substantial momentum. Professor Roy Stars from the University of Georgetown notes, \"Japanese followers have reportedly funneled 70 to 80% of the church's total income to South Korea. Japan has effectively become the church's financial base, largely due to its skillful exploitation of historical guilt. Some adherence becomes so obsessed with donating that they drive their families into financial ruin. Despite this, the ruling LDP did little to reign in the church's activities. In fact, many senior party members had connections with the church and received various forms of support from its network. Professor Stars expands. AB and the LDP largely ignored the issue, benefiting from the church's unwavering political support. Many LDP lawmakers admitted that church members served as reliable voters, fundraisers, and campaign workers. The mother of AB's killer had sent $700,000 and donated her home to the church, bankrupting the family to a point where they often couldn't afford to buy food. Though the assassin originally planned on targeting the church's president, he couldn't approach her, so he switched to Abbe, who he believed to be one of the most influential Unification Church sympathizers in the world. Once the assassin's motives were made clear and investigators tried to see if there was any substance to these Unification Church LDP Association claims, information started pouring out. Many Japanese people for the first time learned about the Unification Church and its decadesl long history of arguably exploitative practices in Japan, as well as the LDP's ties to that organization. When the LDP tried to distance itself from the church via an internal investigation, it accidentally ended up revealing that approximately half of its lawmakers had associated with the group. Which brings me back to the recent election. While I'm sure the BBC has covered the unification church scandal in detail in different articles, it isn't mentioned in the piece about the Sansto, which I believe may cause some readers to assume that Japanese voters who resonated with that silent invasion rhetoric did so only because they're suspicious of skiers in Hokkaido and hardworking immigrants. It may cause foreigners who are unaware of the depth of the unification church scandal to think that Japanese voters are unfounded in their suspicion of foreign influence. In reality, until very recently, many members of Japan's most powerful political party had ties to what critics have described as a foreign cultlike religion. Connections that some argue came at the expense of ordinary citizens. And just as the nation was starting to recover from the shock of that scandal, multiple members of that same political party, the LDP, were found to have failed to report over 600 million yen in political fundraising income. Did some Japanese people vote for the Sansto because they see tourists and immigrants as a silent invasion? Yes. But I believe most, perhaps the overwhelming majority of Sansto supporters voted the way they did, not because they have an issue with people like you and me, but because they were deeply frustrated with the LDP, what many people see as the corrupt political old guard. I think the fact that the Santo gained roughly the same number of seats that the LDP lost is further evidence of this. But there are other political parties in Japan. Why did the new party using foreigners to fearmonger get all those votes? Is that not strong evidence of a big rise in anti-forigner sentiment in Japan? It is in a vacuum. But the Satoto was doing other things to stand out from the crowd. I think the primary reason the Sansto in particular did so well is because they're social media native. While some of the Sansto's stated goals such as changing the constitution are quite extreme, many of their other goals such as lower sales taxes and higher international tourist taxes are neither extreme nor unique to their party. But the Satoto started out on YouTube, so they know how to play the game. They know how to make a standout thumbnail and a catchy title and how to properly light and mic a young well-dressed subject who like this speaks directly to the viewer. And most importantly, they regularly post free content. The other parties do the exact opposite. They never post free, meaningful content to their YouTube channels, but then right before the election flood the platform with unskipable ads of 70-year-old men making vague statements like one step forward. It's the digital equivalent of not doing anything for a year and then right before the election sending out a fleet of obnoxious election vans that just say the politician's name on repeat. It makes people think, \"I'm not going to vote for you just because you're doing this.\" It's a social media strategy. It's a strategy at large that if anything, alienates potential voters, even if the party in question also wants lower sales taxes and higher international tourist taxes. I think the Sansto in particular did so well because they were the only party to capitalize via social media on the LDP exodus which was triggered by two massive scandals and heightened by their perceived failure to address newer issues primarily the rising cost of living. Over tourism is becoming a larger issue and the Santo took advantage of this too by fear-mongering at the expense of all foreigners. I can't condone that. But I also can't condone jumping on social media to return the favor, to accuse every single one of their supporters of unfounded xenophobia, especially when evidence points to most simply being disillusioned LDP voters. It's ironic. There's a lot of Japan is cooked content going around these days. Some of it from Japanese politicians and some of their supporters. Much of it actually from foreigners that neither live here nor speak the language. And everyone's entitled to use the internet how they choose. But nobody's talking about the elephant in the room. Nobody's talking about the fact that for every 10-second reel of a foreigner walking by a broken window in Kamata or some graffiti in Nakameoro, there are 15 videos uploaded to Japanese YouTube showing the opposite. Italian man tries authentic Japanese ramen. Koreans are amazed by their first ride on the bullet train. Why foreigners are choosing to work in Japan despite the weak yen. The fastest growing genre on Japanese YouTube is foreigners reacting to and celebrating Japan. That meme that we have in the west thing thing Japan the opposite exists here. Japanese karate teacher nobody bats an eyelash. Foreign karate teacher in Japan. Sir, may we make you a documentary? And the comment sections for these videos are always filled with conservative sentiment. It's always, \"This makes me proud to be Japanese. Thank you for loving Japan. This reminds me of why I love this country so much.\" The members of the two groups social media has framed as utterly incompatible are often best friends in real life. Foreigners in Japan, the people that left their homes, flew halfway around the world, and learned an entirely new language because of their passion for Japanese culture. and Japanese conservatives, the citizens here most passionate about maintaining and celebrating that culture were both just superce So let not the distorted lens of social media but the experiences we have here shape our views on the country and its people. If each one of us does this, we may yet be able to lower the temperature and avoid the hyper polarization sweeping across much of the rest of the world right now. I implore all of us to touch some sheibahu because that simple act is what stands between this country becoming the hellscape sensationalist portray and the amazing nation it actually is."
}